using WrittenNumber.Models;

namespace WrittenNumber.Data.ru
{
	public static class Currencies
	{
		public static Dictionary<string, Currency> Get()
		{
			return new Dictionary<string, Currency>()
			{
				["AED"] = new Currency()
				{
					One = "дирхам ОАЭ",
					Few = "дирхама ОАЭ",
					Many = "дирхамов ОАЭ",
					Other = "дирхама ОАЭ",
				},
				["AFN"] = new Currency()
				{
					Few = "афгани",
					Many = "афгани",
					Other = "афгани",
				},
				["ALL"] = new Currency()
				{
					One = "албанский лек",
					Few = "албанских лека",
					Many = "албанских леков",
					Other = "албанского лека",
				},
				["AMD"] = new Currency()
				{
					One = "армянский драм",
					Few = "армянских драма",
					Many = "армянских драмов",
					Other = "армянского драма",
				},
				["ANG"] = new Currency()
				{
					One = "нидерландский антильский гульден",
					Few = "нидерландских антильских гульдена",
					Many = "нидерландских антильских гульденов",
					Other = "нидерландского антильского гульдена",
				},
				["AOA"] = new Currency()
				{
					One = "ангольская кванза",
					Few = "ангольские кванзы",
					Many = "ангольских кванз",
					Other = "ангольской кванзы",
				},
				["ARS"] = new Currency()
				{
					One = "аргентинский песо",
					Few = "аргентинских песо",
					Many = "аргентинских песо",
					Other = "аргентинского песо",
				},
				["AUD"] = new Currency()
				{
					One = "австралийский доллар",
					Few = "австралийских доллара",
					Many = "австралийских долларов",
					Other = "австралийского доллара",
				},
				["AWG"] = new Currency()
				{
					One = "арубанский флорин",
					Few = "арубанских флорина",
					Many = "арубанских флоринов",
					Other = "арубанского флорина",
				},
				["BAM"] = new Currency()
				{
					One = "конвертируемая марка Боснии и Герцеговины",
					Few = "конвертируемые марки Боснии и Герцеговины",
					Many = "конвертируемых марок Боснии и Герцеговины",
					Other = "конвертируемой марки Боснии и Герцеговины",
				},
				["BBD"] = new Currency()
				{
					One = "барбадосский доллар",
					Few = "барбадосских доллара",
					Many = "барбадосских долларов",
					Other = "барбадосского доллара",
				},
				["BDT"] = new Currency()
				{
					One = "бангладешская така",
					Few = "бангладешские таки",
					Many = "бангладешских так",
					Other = "бангладешской таки",
				},
				["BGN"] = new Currency()
				{
					One = "болгарский лев",
					Few = "болгарских лева",
					Many = "болгарских левов",
					Other = "болгарского лева",
				},
				["BHD"] = new Currency()
				{
					One = "бахрейнский динар",
					Few = "бахрейнских динара",
					Many = "бахрейнских динаров",
					Other = "бахрейнского динара",
				},
				["BIF"] = new Currency()
				{
					One = "бурундийский франк",
					Few = "бурундийских франка",
					Many = "бурундийских франков",
					Other = "бурундийского франка",
				},
				["BMD"] = new Currency()
				{
					One = "бермудский доллар",
					Few = "бермудских доллара",
					Many = "бермудских долларов",
					Other = "бермудского доллара",
				},
				["BND"] = new Currency()
				{
					One = "брунейский доллар",
					Few = "брунейских доллара",
					Many = "брунейских долларов",
					Other = "брунейского доллара",
				},
				["BOB"] = new Currency()
				{
					One = "боливийский боливиано",
					Few = "боливийских боливиано",
					Many = "боливийских боливиано",
					Other = "боливийского боливиано",
				},
				["BRL"] = new Currency()
				{
					One = "бразильский реал",
					Few = "бразильских реала",
					Many = "бразильских реалов",
					Other = "бразильского реала",
				},
				["BTN"] = new Currency()
				{
					One = "бутанский нгултрум",
					Few = "бутанских нгултрума",
					Many = "бутанских нгултрумов",
					Other = "бутанского нгултрума",
				},
				["BWP"] = new Currency()
				{
					One = "ботсванская пула",
					Few = "ботсванские пулы",
					Many = "ботсванских пул",
					Other = "ботсванской пулы",
				},
				["BYN"] = new Currency()
				{
					One = "белорусский рубль",
					Few = "белорусских рубля",
					Many = "белорусских рублей",
					Other = "белорусского рубля",
				},
				["BZD"] = new Currency()
				{
					One = "белизский доллар",
					Few = "белизских доллара",
					Many = "белизских долларов",
					Other = "белизского доллара",
				},
				["CAD"] = new Currency()
				{
					One = "канадский доллар",
					Few = "канадских доллара",
					Many = "канадских долларов",
					Other = "канадского доллара",
				},
				["CDF"] = new Currency()
				{
					One = "конголезский франк",
					Few = "конголезских франка",
					Many = "конголезских франков",
					Other = "конголезского франка",
				},
				["CHF"] = new Currency()
				{
					One = "швейцарский франк",
					Few = "швейцарских франка",
					Many = "швейцарских франков",
					Other = "швейцарского франка",
				},
				["CNY"] = new Currency()
				{
					One = "китайский юань",
					Few = "китайских юаня",
					Many = "китайских юаней",
					Other = "китайского юаня",
				},
				["COP"] = new Currency()
				{
					One = "колумбийский песо",
					Few = "колумбийских песо",
					Many = "колумбийских песо",
					Other = "колумбийского песо",
				},
				["CRC"] = new Currency()
				{
					One = "костариканский колон",
					Few = "костариканских колона",
					Many = "костариканских колонов",
					Other = "костариканского колона",
				},
				["CUC"] = new Currency()
				{
					One = "кубинский конвертируемый песо",
					Few = "кубинских конвертируемых песо",
					Many = "кубинских конвертируемых песо",
					Other = "кубинского конвертируемого песо",
				},
				["CUP"] = new Currency()
				{
					One = "кубинский песо",
					Few = "кубинских песо",
					Many = "кубинских песо",
					Other = "кубинского песо",
				},
				["CVE"] = new Currency()
				{
					Few = "эскудо Кабо-Верде",
					Many = "эскудо Кабо-Верде",
					Other = "эскудо Кабо-Верде",
				},
				["CZK"] = new Currency()
				{
					One = "чешская крона",
					Few = "чешские кроны",
					Many = "чешских крон",
					Other = "чешской кроны",
				},
				["DJF"] = new Currency()
				{
					One = "франк Джибути",
					Few = "франка Джибути",
					Many = "франков Джибути",
					Other = "франка Джибути",
				},
				["DKK"] = new Currency()
				{
					One = "датская крона",
					Few = "датские кроны",
					Many = "датских крон",
					Other = "датской кроны",
				},
				["DOP"] = new Currency()
				{
					One = "доминиканский песо",
					Few = "доминиканских песо",
					Many = "доминиканских песо",
					Other = "доминиканского песо",
				},
				["DZD"] = new Currency()
				{
					One = "алжирский динар",
					Few = "алжирских динара",
					Many = "алжирских динаров",
					Other = "алжирского динара",
				},
				["EGP"] = new Currency()
				{
					One = "египетский фунт",
					Few = "египетских фунта",
					Many = "египетских фунтов",
					Other = "египетского фунта",
				},
				["ERN"] = new Currency()
				{
					One = "эритрейская накфа",
					Few = "эритрейские накфы",
					Many = "эритрейских накф",
					Other = "эритрейской накфы",
				},
				["ETB"] = new Currency()
				{
					One = "эфиопский быр",
					Few = "эфиопских быра",
					Many = "эфиопских быров",
					Other = "эфиопского быра",
				},
				["EUR"] = new Currency()
				{
					Few = "евро",
					Many = "евро",
					Other = "евро",
				},
				["FJD"] = new Currency()
				{
					One = "доллар Фиджи",
					Few = "доллара Фиджи",
					Many = "долларов Фиджи",
					Other = "доллара Фиджи",
				},
				["FKP"] = new Currency()
				{
					One = "фунт Фолклендских островов",
					Few = "фунта Фолклендских островов",
					Many = "фунтов Фолклендских островов",
					Other = "фунта Фолклендских островов",
				},
				["GBP"] = new Currency()
				{
					One = "британский фунт стерлингов",
					Few = "британских фунта стерлингов",
					Many = "британских фунтов стерлингов",
					Other = "британского фунта стерлингов",
				},
				["GEL"] = new Currency()
				{
					One = "грузинский лари",
					Few = "грузинских лари",
					Many = "грузинских лари",
					Other = "грузинского лари",
				},
				["GHS"] = new Currency()
				{
					One = "ганский седи",
					Few = "ганских седи",
					Many = "ганских седи",
					Other = "ганского седи",
				},
				["GIP"] = new Currency()
				{
					One = "гибралтарский фунт",
					Few = "гибралтарских фунта",
					Many = "гибралтарских фунтов",
					Other = "гибралтарского фунта",
				},
				["GMD"] = new Currency()
				{
					One = "гамбийский даласи",
					Few = "гамбийских даласи",
					Many = "гамбийских даласи",
					Other = "гамбийского даласи",
				},
				["GNF"] = new Currency()
				{
					One = "гвинейский франк",
					Few = "гвинейских франка",
					Many = "гвинейских франков",
					Other = "гвинейского франка",
				},
				["GTQ"] = new Currency()
				{
					One = "гватемальский кетсаль",
					Few = "гватемальских кетсаля",
					Many = "гватемальских кетсалей",
					Other = "гватемальского кетсаля",
				},
				["GYD"] = new Currency()
				{
					One = "гайанский доллар",
					Few = "гайанских доллара",
					Many = "гайанских долларов",
					Other = "гайанского доллара",
				},
				["HKD"] = new Currency()
				{
					One = "гонконгский доллар",
					Few = "гонконгских доллара",
					Many = "гонконгских долларов",
					Other = "гонконгского доллара",
				},
				["HNL"] = new Currency()
				{
					One = "гондурасская лемпира",
					Few = "гондурасские лемпиры",
					Many = "гондурасских лемпир",
					Other = "гондурасской лемпиры",
				},
				["HRK"] = new Currency()
				{
					One = "хорватская куна",
					Few = "хорватские куны",
					Many = "хорватских кун",
					Other = "хорватской куны",
				},
				["HTG"] = new Currency()
				{
					One = "гаитянский гурд",
					Few = "гаитянских гурда",
					Many = "гаитянских гурдов",
					Other = "гаитянского гурда",
				},
				["HUF"] = new Currency()
				{
					One = "венгерский форинт",
					Few = "венгерских форинта",
					Many = "венгерских форинтов",
					Other = "венгерского форинта",
				},
				["IDR"] = new Currency()
				{
					One = "индонезийская рупия",
					Few = "индонезийские рупии",
					Many = "индонезийских рупий",
					Other = "индонезийской рупии",
				},
				["ILS"] = new Currency()
				{
					One = "новый израильский шекель",
					Few = "новых израильских шекеля",
					Many = "новых израильских шекелей",
					Other = "нового израильского шекеля",
				},
				["INR"] = new Currency()
				{
					One = "индийская рупия",
					Few = "индийские рупии",
					Many = "индийских рупий",
					Other = "индийской рупии",
				},
				["IQD"] = new Currency()
				{
					One = "иракский динар",
					Few = "иракских динара",
					Many = "иракских динаров",
					Other = "иракского динара",
				},
				["IRR"] = new Currency()
				{
					One = "иранский риал",
					Few = "иранских риала",
					Many = "иранских риалов",
					Other = "иранского риала",
				},
				["ISK"] = new Currency()
				{
					One = "исландская крона",
					Few = "исландские кроны",
					Many = "исландских крон",
					Other = "исландской кроны",
				},
				["JMD"] = new Currency()
				{
					One = "ямайский доллар",
					Few = "ямайских доллара",
					Many = "ямайских долларов",
					Other = "ямайского доллара",
				},
				["JOD"] = new Currency()
				{
					One = "иорданский динар",
					Few = "иорданских динара",
					Many = "иорданских динаров",
					Other = "иорданского динара",
				},
				["JPY"] = new Currency()
				{
					One = "японская иена",
					Few = "японские иены",
					Many = "японских иен",
					Other = "японской иены",
				},
				["KES"] = new Currency()
				{
					One = "кенийский шиллинг",
					Few = "кенийских шиллинга",
					Many = "кенийских шиллингов",
					Other = "кенийского шиллинга",
				},
				["KGS"] = new Currency()
				{
					One = "киргизский сом",
					Few = "киргизских сома",
					Many = "киргизских сомов",
					Other = "киргизского сома",
				},
				["KHR"] = new Currency()
				{
					One = "камбоджийский риель",
					Few = "камбоджийских риеля",
					Many = "камбоджийских риелей",
					Other = "камбоджийского риеля",
				},
				["KMF"] = new Currency()
				{
					One = "коморский франк",
					Few = "коморских франка",
					Many = "коморских франков",
					Other = "коморского франка",
				},
				["KPW"] = new Currency()
				{
					One = "северокорейская вона",
					Few = "северокорейские воны",
					Many = "северокорейских вон",
					Other = "северокорейской воны",
				},
				["KRW"] = new Currency()
				{
					One = "южнокорейская вона",
					Few = "южнокорейские воны",
					Many = "южнокорейских вон",
					Other = "южнокорейской воны",
				},
				["KWD"] = new Currency()
				{
					One = "кувейтский динар",
					Few = "кувейтских динара",
					Many = "кувейтских динаров",
					Other = "кувейтского динара",
				},
				["KYD"] = new Currency()
				{
					One = "доллар Островов Кайман",
					Few = "доллара Островов Кайман",
					Many = "долларов Островов Кайман",
					Other = "доллара Островов Кайман",
				},
				["KZT"] = new Currency()
				{
					One = "казахский тенге",
					Few = "казахских тенге",
					Many = "казахских тенге",
					Other = "казахского тенге",
				},
				["LAK"] = new Currency()
				{
					One = "лаосский кип",
					Few = "лаосских кипа",
					Many = "лаосских кипов",
					Other = "лаосского кипа",
				},
				["LBP"] = new Currency()
				{
					One = "ливанский фунт",
					Few = "ливанских фунта",
					Many = "ливанских фунтов",
					Other = "ливанского фунта",
				},
				["LKR"] = new Currency()
				{
					One = "шри-ланкийская рупия",
					Few = "шри-ланкийские рупии",
					Many = "шри-ланкийских рупий",
					Other = "шри-ланкийской рупии",
				},
				["LRD"] = new Currency()
				{
					One = "либерийский доллар",
					Few = "либерийских доллара",
					Many = "либерийских долларов",
					Other = "либерийского доллара",
				},
				["LSL"] = new Currency()
				{
					Few = "лоти",
					Many = "лоти",
					Other = "лоти",
				},
				["LYD"] = new Currency()
				{
					One = "ливийский динар",
					Few = "ливийских динара",
					Many = "ливийских динаров",
					Other = "ливийского динара",
				},
				["MAD"] = new Currency()
				{
					One = "марокканский дирхам",
					Few = "марокканских дирхама",
					Many = "марокканских дирхамов",
					Other = "марокканского дирхама",
				},
				["MDL"] = new Currency()
				{
					One = "молдавский лей",
					Few = "молдавских лея",
					Many = "молдавских леев",
					Other = "молдавского лея",
				},
				["MGA"] = new Currency()
				{
					One = "малагасийский ариари",
					Few = "малагасийских ариари",
					Many = "малагасийских ариари",
					Other = "малагасийского ариари",
				},
				["MKD"] = new Currency()
				{
					One = "македонский денар",
					Few = "македонских денара",
					Many = "македонских денаров",
					Other = "македонского денара",
				},
				["MMK"] = new Currency()
				{
					One = "мьянманский кьят",
					Few = "мьянманских кьята",
					Many = "мьянманских кьятов",
					Other = "мьянманского кьята",
				},
				["MNT"] = new Currency()
				{
					One = "монгольский тугрик",
					Few = "монгольских тугрика",
					Many = "монгольских тугриков",
					Other = "монгольского тугрика",
				},
				["MOP"] = new Currency()
				{
					One = "патака Макао",
					Few = "патаки Макао",
					Many = "патак Макао",
					Other = "патаки Макао",
				},
				["MRU"] = new Currency()
				{
					One = "мавританская угия",
					Few = "мавританские угии",
					Many = "мавританских угий",
					Other = "мавританской угии",
				},
				["MUR"] = new Currency()
				{
					One = "маврикийская рупия",
					Few = "маврикийские рупии",
					Many = "маврикийских рупий",
					Other = "маврикийской рупии",
				},
				["MVR"] = new Currency()
				{
					One = "мальдивская руфия",
					Few = "мальдивские руфии",
					Many = "мальдивских руфий",
					Other = "мальдивской руфии",
				},
				["MWK"] = new Currency()
				{
					One = "малавийская квача",
					Few = "малавийские квачи",
					Many = "малавийских квач",
					Other = "малавийской квачи",
				},
				["MXN"] = new Currency()
				{
					One = "мексиканский песо",
					Few = "мексиканских песо",
					Many = "мексиканских песо",
					Other = "мексиканского песо",
				},
				["MYR"] = new Currency()
				{
					One = "малайзийский ринггит",
					Few = "малайзийских ринггита",
					Many = "малайзийских ринггитов",
					Other = "малайзийского ринггита",
				},
				["MZN"] = new Currency()
				{
					One = "мозамбикский метикал",
					Few = "мозамбикских метикала",
					Many = "мозамбикских метикалов",
					Other = "мозамбикского метикала",
				},
				["NAD"] = new Currency()
				{
					One = "доллар Намибии",
					Few = "доллара Намибии",
					Many = "долларов Намибии",
					Other = "доллара Намибии",
				},
				["NGN"] = new Currency()
				{
					One = "нигерийская найра",
					Few = "нигерийские найры",
					Many = "нигерийских найр",
					Other = "нигерийской найры",
				},
				["NIO"] = new Currency()
				{
					One = "никарагуанская кордоба",
					Few = "никарагуанские кордобы",
					Many = "никарагуанских кордоб",
					Other = "никарагуанской кордобы",
				},
				["NOK"] = new Currency()
				{
					One = "норвежская крона",
					Few = "норвежские кроны",
					Many = "норвежских крон",
					Other = "норвежской кроны",
				},
				["NPR"] = new Currency()
				{
					One = "непальская рупия",
					Few = "непальские рупии",
					Many = "непальских рупий",
					Other = "непальской рупии",
				},
				["NZD"] = new Currency()
				{
					One = "новозеландский доллар",
					Few = "новозеландских доллара",
					Many = "новозеландских долларов",
					Other = "новозеландского доллара",
				},
				["OMR"] = new Currency()
				{
					One = "оманский риал",
					Few = "оманских риала",
					Many = "оманских риалов",
					Other = "оманского риала",
				},
				["PAB"] = new Currency()
				{
					One = "панамский бальбоа",
					Few = "панамских бальбоа",
					Many = "панамских бальбоа",
					Other = "панамского бальбоа",
				},
				["PEN"] = new Currency()
				{
					One = "перуанский соль",
					Few = "перуанских соля",
					Many = "перуанских солей",
					Other = "перуанского соля",
				},
				["PGK"] = new Currency()
				{
					One = "кина Папуа – Новой Гвинеи",
					Few = "кины Папуа – Новой Гвинеи",
					Many = "кин Папуа – Новой Гвинеи",
					Other = "кины Папуа – Новой Гвинеи",
				},
				["PHP"] = new Currency()
				{
					One = "филиппинский песо",
					Few = "филиппинских песо",
					Many = "филиппинских песо",
					Other = "филиппинского песо",
				},
				["PKR"] = new Currency()
				{
					One = "пакистанская рупия",
					Few = "пакистанские рупии",
					Many = "пакистанских рупий",
					Other = "пакистанской рупии",
				},
				["PLN"] = new Currency()
				{
					One = "польский злотый",
					Few = "польских злотых",
					Many = "польских злотых",
					Other = "польского злотого",
				},
				["PYG"] = new Currency()
				{
					One = "парагвайский гуарани",
					Few = "парагвайских гуарани",
					Many = "парагвайских гуарани",
					Other = "парагвайского гуарани",
				},
				["QAR"] = new Currency()
				{
					One = "катарский риал",
					Few = "катарских риала",
					Many = "катарских риалов",
					Other = "катарского риала",
				},
				["RON"] = new Currency()
				{
					One = "румынский лей",
					Few = "румынских лея",
					Many = "румынских леев",
					Other = "румынского лея",
				},
				["RSD"] = new Currency()
				{
					One = "сербский динар",
					Few = "сербских динара",
					Many = "сербских динаров",
					Other = "сербского динара",
				},
				["RUB"] = new Currency()
				{
					One = "российский рубль",
					Few = "российских рубля",
					Many = "российских рублей",
					Other = "российского рубля",
				},
				["RWF"] = new Currency()
				{
					One = "франк Руанды",
					Few = "франка Руанды",
					Many = "франков Руанды",
					Other = "франка Руанды",
				},
				["SAR"] = new Currency()
				{
					One = "саудовский риял",
					Few = "саудовских рияла",
					Many = "саудовских риялов",
					Other = "саудовского рияла",
				},
				["SBD"] = new Currency()
				{
					One = "доллар Соломоновых Островов",
					Few = "доллара Соломоновых Островов",
					Many = "долларов Соломоновых Островов",
					Other = "доллара Соломоновых Островов",
				},
				["SCR"] = new Currency()
				{
					One = "сейшельская рупия",
					Few = "сейшельские рупии",
					Many = "сейшельских рупий",
					Other = "сейшельской рупии",
				},
				["SDG"] = new Currency()
				{
					One = "суданский фунт",
					Few = "суданских фунта",
					Many = "суданских фунтов",
					Other = "суданского фунта",
				},
				["SEK"] = new Currency()
				{
					One = "шведская крона",
					Few = "шведские кроны",
					Many = "шведских крон",
					Other = "шведской кроны",
				},
				["SGD"] = new Currency()
				{
					One = "сингапурский доллар",
					Few = "сингапурских доллара",
					Many = "сингапурских долларов",
					Other = "сингапурского доллара",
				},
				["SHP"] = new Currency()
				{
					One = "фунт острова Святой Елены",
					Few = "фунта острова Святой Елены",
					Many = "фунтов острова Святой Елены",
					Other = "фунта острова Святой Елены",
				},
				["SLL"] = new Currency()
				{
					Few = "леоне",
					Many = "леоне",
					Other = "леоне",
				},
				["SOS"] = new Currency()
				{
					One = "сомалийский шиллинг",
					Few = "сомалийских шиллинга",
					Many = "сомалийских шиллингов",
					Other = "сомалийского шиллинга",
				},
				["SRD"] = new Currency()
				{
					One = "суринамский доллар",
					Few = "суринамских доллара",
					Many = "суринамских долларов",
					Other = "суринамского доллара",
				},
				["SSP"] = new Currency()
				{
					One = "южносуданский фунт",
					Few = "южносуданских фунта",
					Many = "южносуданских фунтов",
					Other = "южносуданского фунта",
				},
				["STN"] = new Currency()
				{
					One = "добра Сан-Томе и Принсипи",
					Few = "добры Сан-Томе и Принсипи",
					Many = "добр Сан-Томе и Принсипи",
					Other = "добры Сан-Томе и Принсипи",
				},
				["SYP"] = new Currency()
				{
					One = "сирийский фунт",
					Few = "сирийских фунта",
					Many = "сирийских фунтов",
					Other = "сирийского фунта",
				},
				["SZL"] = new Currency()
				{
					One = "свазилендский лилангени",
					Few = "свазилендских лилангени",
					Many = "свазилендских лилангени",
					Other = "свазилендского лилангени",
				},
				["THB"] = new Currency()
				{
					One = "таиландский бат",
					Few = "таиландских бата",
					Many = "таиландских батов",
					Other = "таиландского бата",
				},
				["TJS"] = new Currency()
				{
					One = "таджикский сомони",
					Few = "таджикских сомони",
					Many = "таджикских сомони",
					Other = "таджикского сомони",
				},
				["TMT"] = new Currency()
				{
					One = "новый туркменский манат",
					Few = "новых туркменских маната",
					Many = "новых туркменских манатов",
					Other = "нового туркменского маната",
				},
				["TND"] = new Currency()
				{
					One = "тунисский динар",
					Few = "тунисских динара",
					Many = "тунисских динаров",
					Other = "тунисского динара",
				},
				["TOP"] = new Currency()
				{
					One = "тонганская паанга",
					Few = "тонганские паанги",
					Many = "тонганских паанг",
					Other = "тонганской паанги",
				},
				["TRY"] = new Currency()
				{
					One = "турецкая лира",
					Few = "турецкие лиры",
					Many = "турецких лир",
					Other = "турецкой лиры",
				},
				["TTD"] = new Currency()
				{
					One = "доллар Тринидада и Тобаго",
					Few = "доллара Тринидада и Тобаго",
					Many = "долларов Тринидада и Тобаго",
					Other = "доллара Тринидада и Тобаго",
				},
				["TWD"] = new Currency()
				{
					One = "новый тайваньский доллар",
					Few = "новых тайваньских доллара",
					Many = "новых тайваньских долларов",
					Other = "нового тайваньского доллара",
				},
				["TZS"] = new Currency()
				{
					One = "танзанийский шиллинг",
					Few = "танзанийских шиллинга",
					Many = "танзанийских шиллингов",
					Other = "танзанийского шиллинга",
				},
				["UAH"] = new Currency()
				{
					One = "украинская гривна",
					Few = "украинские гривны",
					Many = "украинских гривен",
					Other = "украинской гривны",
				},
				["UGX"] = new Currency()
				{
					One = "угандийский шиллинг",
					Few = "угандийских шиллинга",
					Many = "угандийских шиллингов",
					Other = "угандийского шиллинга",
				},
				["USD"] = new Currency()
				{
					One = "доллар США",
					Few = "доллара США",
					Many = "долларов США",
					Other = "доллара США",
				},
				["UYU"] = new Currency()
				{
					One = "уругвайский песо",
					Few = "уругвайских песо",
					Many = "уругвайских песо",
					Other = "уругвайского песо",
				},
				["UZS"] = new Currency()
				{
					One = "узбекский сум",
					Few = "узбекских сума",
					Many = "узбекских сумов",
					Other = "узбекского сума",
				},
				["VES"] = new Currency()
				{
					One = "венесуэльский боливар",
					Few = "венесуэльских боливара",
					Many = "венесуэльских боливаров",
					Other = "венесуэльского боливара",
				},
				["VND"] = new Currency()
				{
					One = "вьетнамский донг",
					Few = "вьетнамских донга",
					Many = "вьетнамских донгов",
					Other = "вьетнамского донга",
				},
				["VUV"] = new Currency()
				{
					Few = "вату Вануату",
					Many = "вату Вануату",
					Other = "вату Вануату",
				},
				["WST"] = new Currency()
				{
					One = "самоанская тала",
					Few = "самоанские талы",
					Many = "самоанских тал",
					Other = "самоанской талы",
				},
				["XAF"] = new Currency()
				{
					One = "франк КФА ВЕАС",
					Few = "франка КФА ВЕАС",
					Many = "франков КФА ВЕАС",
					Other = "франка КФА ВЕАС",
				},
				["XCD"] = new Currency()
				{
					One = "восточно-карибский доллар",
					Few = "восточно-карибских доллара",
					Many = "восточно-карибских долларов",
					Other = "восточно-карибского доллара",
				},
				["XOF"] = new Currency()
				{
					One = "франк КФА ВСЕАО",
					Few = "франка КФА ВСЕАО",
					Many = "франков КФА ВСЕАО",
					Other = "франка КФА ВСЕАО",
				},
				["XPF"] = new Currency()
				{
					One = "французский тихоокеанский франк",
					Few = "французских тихоокеанских франка",
					Many = "французских тихоокеанских франков",
					Other = "французского тихоокеанского франка",
				},
				["YER"] = new Currency()
				{
					One = "йеменский риал",
					Few = "йеменских риала",
					Many = "йеменских риалов",
					Other = "йеменского риала",
				},
				["ZAR"] = new Currency()
				{
					One = "южноафриканский рэнд",
					Few = "южноафриканских рэнда",
					Many = "южноафриканских рэндов",
					Other = "южноафриканского рэнда",
				},
				["ZMW"] = new Currency()
				{
					One = "замбийская квача",
					Few = "замбийские квачи",
					Many = "замбийских квач",
					Other = "замбийской квачи",
				},
			};
		}
	}
}
