using WrittenNumber.Models;

namespace WrittenNumber.Data.uk
{
	public static class Currencies
	{
		public static Dictionary<string, Currency> Get()
		{
			return new Dictionary<string, Currency>()
			{
				["AED"] = new Currency()
				{
					One = "дирхам ОАЕ",
					Few = "дирхами ОАЕ",
					Many = "дирхамів ОАЕ",
					Other = "дирхама ОАЕ",
				},
				["AFN"] = new Currency()
				{
					One = "афганський афгані",
					Few = "афганські афгані",
					Many = "афганських афгані",
					Other = "афганського афгані",
				},
				["ALL"] = new Currency()
				{
					One = "албанський лек",
					Few = "албанські леки",
					Many = "албанських леків",
					Other = "албанського лека",
				},
				["AMD"] = new Currency()
				{
					One = "вірменський драм",
					Few = "вірменські драми",
					Many = "вірменських драмів",
					Other = "вірменського драма",
				},
				["ANG"] = new Currency()
				{
					One = "нідерландський антильський гульден",
					Few = "нідерландські антильські гульдени",
					Many = "нідерландських антильських гульденів",
					Other = "нідерландського антильського гульдена",
				},
				["AOA"] = new Currency()
				{
					One = "ангольська кванза",
					Few = "ангольські кванзи",
					Many = "ангольських кванз",
					Other = "ангольської кванзи",
				},
				["ARS"] = new Currency()
				{
					One = "аргентинський песо",
					Few = "аргентинські песо",
					Many = "аргентинських песо",
					Other = "аргентинського песо",
				},
				["AUD"] = new Currency()
				{
					One = "австралійський долар",
					Few = "австралійські долари",
					Many = "австралійських доларів",
					Other = "австралійського долара",
				},
				["AWG"] = new Currency()
				{
					One = "арубський флорин",
					Few = "арубські флорини",
					Many = "арубських флоринів",
					Other = "арубського флорина",
				},
				["BAM"] = new Currency()
				{
					One = "конвертована марка Боснії і Герцеговини",
					Few = "конвертовані марки Боснії і Герцеговини",
					Many = "конвертованих марок Боснії і Герцеговини",
					Other = "конвертованої марки Боснії і Герцеговини",
				},
				["BBD"] = new Currency()
				{
					One = "барбадоський долар",
					Few = "барбадоські долари",
					Many = "барбадоських доларів",
					Other = "барбадоського долара",
				},
				["BDT"] = new Currency()
				{
					One = "бангладеська така",
					Few = "бангладеські таки",
					Many = "бангладеських так",
					Other = "бангладеської таки",
				},
				["BGN"] = new Currency()
				{
					One = "болгарський лев",
					Few = "болгарські леви",
					Many = "болгарських левів",
					Other = "болгарського лева",
				},
				["BHD"] = new Currency()
				{
					One = "бахрейнський динар",
					Few = "бахрейнські динари",
					Many = "бахрейнських динарів",
					Other = "бахрейнського динара",
				},
				["BIF"] = new Currency()
				{
					One = "бурундійський франк",
					Few = "бурундійські франки",
					Many = "бурундійських франків",
					Other = "бурундійського франка",
				},
				["BMD"] = new Currency()
				{
					One = "бермудський долар",
					Few = "бермудські долари",
					Many = "бермудських доларів",
					Other = "бермудського долара",
				},
				["BND"] = new Currency()
				{
					One = "брунейський долар",
					Few = "брунейські долари",
					Many = "брунейських доларів",
					Other = "брунейського долара",
				},
				["BOB"] = new Currency()
				{
					One = "болівійський болівіано",
					Few = "болівійські болівіано",
					Many = "болівійських болівіано",
					Other = "болівійського болівіано",
				},
				["BRL"] = new Currency()
				{
					One = "бразильський реал",
					Few = "бразильські реали",
					Many = "бразильських реалів",
					Other = "бразильського реала",
				},
				["BTN"] = new Currency()
				{
					One = "бутанський нгултрум",
					Few = "бутанські нгултруми",
					Many = "бутанських нгултрумів",
					Other = "бутанського нгултрума",
				},
				["BWP"] = new Currency()
				{
					One = "ботсванська пула",
					Few = "ботсванські пули",
					Many = "ботсванських пул",
					Other = "ботсванської пули",
				},
				["BYN"] = new Currency()
				{
					One = "білоруський рубль",
					Few = "білоруські рублі",
					Many = "білоруських рублів",
					Other = "білоруського рубля",
				},
				["BZD"] = new Currency()
				{
					One = "белізький долар",
					Few = "белізькі долари",
					Many = "белізьких доларів",
					Other = "белізького долара",
				},
				["CAD"] = new Currency()
				{
					One = "канадський долар",
					Few = "канадські долари",
					Many = "канадських доларів",
					Other = "канадського долара",
				},
				["CDF"] = new Currency()
				{
					One = "конголезький франк",
					Few = "конголезькі франки",
					Many = "конголезьких франків",
					Other = "конголезького франка",
				},
				["CHF"] = new Currency()
				{
					One = "швейцарський франк",
					Few = "швейцарські франки",
					Many = "швейцарських франків",
					Other = "швейцарського франка",
				},
				["CNY"] = new Currency()
				{
					One = "китайський юань",
					Few = "китайські юані",
					Many = "китайських юанів",
					Other = "китайського юаня",
				},
				["COP"] = new Currency()
				{
					One = "колумбійський песо",
					Few = "колумбійські песо",
					Many = "колумбійських песо",
					Other = "колумбійського песо",
				},
				["CRC"] = new Currency()
				{
					One = "костариканський колон",
					Few = "костариканські колони",
					Many = "костариканських колонів",
					Other = "костариканського колона",
				},
				["CUC"] = new Currency()
				{
					One = "кубинський конвертований песо",
					Few = "кубинські конвертовані песо",
					Many = "кубинських конвертованих песо",
					Other = "кубинського конвертованого песо",
				},
				["CUP"] = new Currency()
				{
					One = "кубинський песо",
					Few = "кубинські песо",
					Many = "кубинських песо",
					Other = "кубинського песо",
				},
				["CVE"] = new Currency()
				{
					Few = "ескудо Кабо-Верде",
					Many = "ескудо Кабо-Верде",
					Other = "ескудо Кабо-Верде",
				},
				["CZK"] = new Currency()
				{
					One = "чеська крона",
					Few = "чеські крони",
					Many = "чеських крон",
					Other = "чеської крони",
				},
				["DJF"] = new Currency()
				{
					One = "джибутійський франк",
					Few = "джибутійські франки",
					Many = "джибутійських франків",
					Other = "джибутійського франка",
				},
				["DKK"] = new Currency()
				{
					One = "данська крона",
					Few = "данські крони",
					Many = "данських крон",
					Other = "данської крони",
				},
				["DOP"] = new Currency()
				{
					One = "домініканський песо",
					Few = "домініканські песо",
					Many = "домініканських песо",
					Other = "домініканського песо",
				},
				["DZD"] = new Currency()
				{
					One = "алжирський динар",
					Few = "алжирські динари",
					Many = "алжирських динарів",
					Other = "алжирського динара",
				},
				["EGP"] = new Currency()
				{
					One = "єгипетський фунт",
					Few = "єгипетські фунти",
					Many = "єгипетських фунтів",
					Other = "єгипетського фунта",
				},
				["ERN"] = new Currency()
				{
					One = "еритрейська накфа",
					Few = "еритрейські накфи",
					Many = "еритрейських накф",
					Other = "еритрейської накфи",
				},
				["ETB"] = new Currency()
				{
					One = "ефіопський бир",
					Few = "ефіопські бири",
					Many = "ефіопських бирів",
					Other = "ефіопського бира",
				},
				["EUR"] = new Currency()
				{
					Few = "євро",
					Many = "євро",
					Other = "євро",
				},
				["FJD"] = new Currency()
				{
					One = "фіджійський долар",
					Few = "фіджійські долари",
					Many = "фіджійських доларів",
					Other = "фіджійського долара",
				},
				["FKP"] = new Currency()
				{
					One = "фунт Фолклендських островів",
					Few = "фунти Фолклендських островів",
					Many = "фунтів Фолклендських островів",
					Other = "фунта Фолклендських островів",
				},
				["GBP"] = new Currency()
				{
					One = "англійський фунт",
					Few = "англійські фунти",
					Many = "англійських фунтів",
					Other = "англійського фунта",
				},
				["GEL"] = new Currency()
				{
					One = "грузинський ларі",
					Few = "грузинські ларі",
					Many = "грузинських ларі",
					Other = "грузинського ларі",
				},
				["GHS"] = new Currency()
				{
					One = "ганський седі",
					Few = "ганські седі",
					Many = "ганських седі",
					Other = "ганського седі",
				},
				["GIP"] = new Currency()
				{
					One = "гібралтарський фунт",
					Few = "гібралтарські фунти",
					Many = "гібралтарських фунтів",
					Other = "гібралтарського фунта",
				},
				["GMD"] = new Currency()
				{
					One = "гамбійський даласі",
					Few = "гамбійські даласі",
					Many = "гамбійських даласі",
					Other = "гамбійського даласі",
				},
				["GNF"] = new Currency()
				{
					One = "гвінейський франк",
					Few = "гвінейські франки",
					Many = "гвінейських франків",
					Other = "гвінейського франка",
				},
				["GTQ"] = new Currency()
				{
					One = "гватемальський кетсаль",
					Few = "гватемальські кетсалі",
					Many = "гватемальських кетсалів",
					Other = "гватемальського кетсаля",
				},
				["GYD"] = new Currency()
				{
					One = "гаянський долар",
					Few = "гаянські долари",
					Many = "гаянських доларів",
					Other = "гаянського долара",
				},
				["HKD"] = new Currency()
				{
					One = "гонконгський долар",
					Few = "гонконгські долари",
					Many = "гонконгських доларів",
					Other = "гонконгського долара",
				},
				["HNL"] = new Currency()
				{
					One = "гондураська лемпіра",
					Few = "гондураські лемпіри",
					Many = "гондураських лемпір",
					Other = "гондураської лемпіри",
				},
				["HRK"] = new Currency()
				{
					One = "хорватська куна",
					Few = "хорватські куни",
					Many = "хорватських кун",
					Other = "хорватської куни",
				},
				["HTG"] = new Currency()
				{
					One = "гаїтянський гурд",
					Few = "гаїтянські гурди",
					Many = "гаїтянських гурдів",
					Other = "гаїтянського гурда",
				},
				["HUF"] = new Currency()
				{
					One = "угорський форинт",
					Few = "угорські форинти",
					Many = "угорських форинтів",
					Other = "угорського форинта",
				},
				["IDR"] = new Currency()
				{
					One = "індонезійська рупія",
					Few = "індонезійські рупії",
					Many = "індонезійських рупій",
					Other = "індонезійські рупії",
				},
				["ILS"] = new Currency()
				{
					One = "ізраїльський новий шекель",
					Few = "ізраїльські нові шекелі",
					Many = "ізраїльських нових шекелів",
					Other = "ізраїльського нового шекеля",
				},
				["INR"] = new Currency()
				{
					One = "індійська рупія",
					Few = "індійські рупії",
					Many = "індійських рупій",
					Other = "індійської рупії",
				},
				["IQD"] = new Currency()
				{
					One = "іракський динар",
					Few = "іракські динари",
					Many = "іракських динарів",
					Other = "іракського динара",
				},
				["IRR"] = new Currency()
				{
					One = "іранський ріал",
					Few = "іранські ріали",
					Many = "іранських ріалів",
					Other = "іранського ріала",
				},
				["ISK"] = new Currency()
				{
					One = "ісландська крона",
					Few = "ісландські кроні",
					Many = "ісландських крон",
					Other = "ісландської крони",
				},
				["JMD"] = new Currency()
				{
					One = "ямайський долар",
					Few = "ямайські долари",
					Many = "ямайських доларів",
					Other = "ямайського долара",
				},
				["JOD"] = new Currency()
				{
					One = "йорданський динар",
					Few = "йорданські динари",
					Many = "йорданських динарів",
					Other = "йорданського динара",
				},
				["JPY"] = new Currency()
				{
					One = "японська єна",
					Few = "японські єни",
					Many = "японських єн",
					Other = "японської єни",
				},
				["KES"] = new Currency()
				{
					One = "кенійський шилінг",
					Few = "кенійські шилінги",
					Many = "кенійських шилінгів",
					Other = "кенійського шилінга",
				},
				["KGS"] = new Currency()
				{
					One = "киргизький сом",
					Few = "киргизькі соми",
					Many = "киргизьких сомів",
					Other = "киргизького сома",
				},
				["KHR"] = new Currency()
				{
					One = "камбоджійський рієль",
					Few = "камбоджійські рієлі",
					Many = "камбоджійських рієлів",
					Other = "камбоджійського рієля",
				},
				["KMF"] = new Currency()
				{
					One = "коморський франк",
					Few = "коморські франки",
					Many = "коморських франків",
					Other = "коморського франка",
				},
				["KPW"] = new Currency()
				{
					One = "північнокорейський вон",
					Few = "північнокорейські вони",
					Many = "північнокорейських вонів",
					Other = "північнокорейського вона",
				},
				["KRW"] = new Currency()
				{
					One = "південнокорейський вон",
					Few = "південнокорейські вони",
					Many = "південнокорейських вонів",
					Other = "південнокорейського вона",
				},
				["KWD"] = new Currency()
				{
					One = "кувейтський динар",
					Few = "кувейтські динари",
					Many = "кувейтських динарів",
					Other = "кувейтського динара",
				},
				["KYD"] = new Currency()
				{
					One = "долар Кайманових островів",
					Few = "долари Кайманових островів",
					Many = "доларів Кайманових островів",
					Other = "долара Кайманових островів",
				},
				["KZT"] = new Currency()
				{
					One = "казахстанський тенге",
					Few = "казахстанські тенге",
					Many = "казахстанських тенге",
					Other = "казахстанського тенге",
				},
				["LAK"] = new Currency()
				{
					One = "лаоський кіп",
					Few = "лаоські кіпи",
					Many = "лаоських кіпів",
					Other = "лаоського кіпа",
				},
				["LBP"] = new Currency()
				{
					One = "ліванський фунт",
					Few = "ліванські фунти",
					Many = "ліванських фунтів",
					Other = "ліванського фунта",
				},
				["LKR"] = new Currency()
				{
					One = "шрі-ланкійська рупія",
					Few = "шрі-ланкійські рупії",
					Many = "шрі-ланкійських рупій",
					Other = "шрі-ланкійської рупії",
				},
				["LRD"] = new Currency()
				{
					One = "ліберійський долар",
					Few = "ліберійські долари",
					Many = "ліберійських доларів",
					Other = "ліберійського долара",
				},
				["LSL"] = new Currency()
				{
					One = "лесотський лоті",
					Few = "лесотські лоті",
					Many = "лесотських лоті",
					Other = "лесотського лоті",
				},
				["LYD"] = new Currency()
				{
					One = "лівійський динар",
					Few = "лівійські динари",
					Many = "лівійських динарів",
					Other = "лівійського динара",
				},
				["MAD"] = new Currency()
				{
					One = "марокканський дирхам",
					Few = "марокканські дирхами",
					Many = "марокканських дирхамів",
					Other = "марокканського дирхама",
				},
				["MDL"] = new Currency()
				{
					One = "молдовський лей",
					Few = "молдовські леї",
					Many = "молдовських леїв",
					Other = "молдовського лея",
				},
				["MGA"] = new Currency()
				{
					One = "малагасійський аріарі",
					Few = "малагасійські аріарі",
					Many = "малагасійських аріарі",
					Other = "малагасійського аріарі",
				},
				["MKD"] = new Currency()
				{
					One = "македонський денар",
					Few = "македонські денари",
					Many = "македонських денарів",
					Other = "македонського денара",
				},
				["MMK"] = new Currency()
				{
					One = "кʼят Мʼянми",
					Few = "кʼяти Мʼянми",
					Many = "кʼятів Мʼянми",
					Other = "кʼята Мʼянми",
				},
				["MNT"] = new Currency()
				{
					One = "монгольський тугрик",
					Few = "монгольські тугрики",
					Many = "монгольських тугриків",
					Other = "монгольського тугрика",
				},
				["MOP"] = new Currency()
				{
					One = "патака Макао",
					Few = "патаки Макао",
					Many = "патак Макао",
					Other = "патаки Макао",
				},
				["MRU"] = new Currency()
				{
					One = "мавританська угія",
					Few = "мавританські угії",
					Many = "мавританських угій",
					Other = "мавританської угії",
				},
				["MUR"] = new Currency()
				{
					One = "маврикійська рупія",
					Few = "маврикійські рупії",
					Many = "маврикійських рупій",
					Other = "маврикійської рупії",
				},
				["MVR"] = new Currency()
				{
					One = "мальдівська руфія",
					Few = "мальдівські руфії",
					Many = "мальдівських руфій",
					Other = "мальдівської руфії",
				},
				["MWK"] = new Currency()
				{
					One = "малавійська квача",
					Few = "малавійські квачі",
					Many = "малавійських квач",
					Other = "малавійської квачі",
				},
				["MXN"] = new Currency()
				{
					One = "мексиканський песо",
					Few = "мексиканські песо",
					Many = "мексиканських песо",
					Other = "мексиканського песо",
				},
				["MYR"] = new Currency()
				{
					One = "малайзійський рингіт",
					Few = "малайзійські рингіти",
					Many = "малайзійських рингітів",
					Other = "малайзійського рингіта",
				},
				["MZN"] = new Currency()
				{
					One = "мозамбіцький метикал",
					Few = "мозамбіцькі метикали",
					Many = "мозамбіцьких метикалів",
					Other = "мозамбіцького метикала",
				},
				["NAD"] = new Currency()
				{
					One = "намібійський долар",
					Few = "намібійські долари",
					Many = "намібійських доларів",
					Other = "намібійського долара",
				},
				["NGN"] = new Currency()
				{
					One = "нігерійська найра",
					Few = "нігерійські найри",
					Many = "нігерійських найр",
					Other = "нігерійської найри",
				},
				["NIO"] = new Currency()
				{
					One = "нікарагуанська кордоба",
					Few = "нікарагуанські кордоби",
					Many = "нікарагуанських кордоб",
					Other = "нікарагуанської кордоби",
				},
				["NOK"] = new Currency()
				{
					One = "норвезька крона",
					Few = "норвезькі крони",
					Many = "норвезьких крон",
					Other = "норвезької крони",
				},
				["NPR"] = new Currency()
				{
					One = "непальська рупія",
					Few = "непальські рупії",
					Many = "непальських рупій",
					Other = "непальської рупії",
				},
				["NZD"] = new Currency()
				{
					One = "новозеландський долар",
					Few = "новозеландські долари",
					Many = "новозеландських доларів",
					Other = "новозеландського долара",
				},
				["OMR"] = new Currency()
				{
					One = "оманський ріал",
					Few = "оманські ріали",
					Many = "оманських ріалів",
					Other = "оманського ріала",
				},
				["PAB"] = new Currency()
				{
					One = "панамське бальбоа",
					Few = "панамські бальбоа",
					Many = "панамських бальбоа",
					Other = "панамського бальбоа",
				},
				["PEN"] = new Currency()
				{
					One = "перуанський новий сол",
					Few = "перуанські нові соли",
					Many = "перуанських нових солів",
					Other = "перуанського нового сола",
				},
				["PGK"] = new Currency()
				{
					One = "кіна Папуа-Нової Ґвінеї",
					Few = "кіни Папуа-Нової Ґвінеї",
					Many = "кін Папуа-Нової Ґвінеї",
					Other = "кіни Папуа-Нової Ґвінеї",
				},
				["PHP"] = new Currency()
				{
					One = "філіппінський песо",
					Few = "філіппінські песо",
					Many = "філіппінських песо",
					Other = "філіппінського песо",
				},
				["PKR"] = new Currency()
				{
					One = "пакистанська рупія",
					Few = "пакистанські рупії",
					Many = "пакистанських рупій",
					Other = "пакистанської рупії",
				},
				["PLN"] = new Currency()
				{
					One = "польський злотий",
					Few = "польські злоті",
					Many = "польських злотих",
					Other = "польського злотого",
				},
				["PYG"] = new Currency()
				{
					One = "парагвайський гуарані",
					Few = "парагвайські гуарані",
					Many = "парагвайських гуарані",
					Other = "парагвайського гуарані",
				},
				["QAR"] = new Currency()
				{
					One = "катарський ріал",
					Few = "катарські ріали",
					Many = "катарських ріалів",
					Other = "катарського ріала",
				},
				["RON"] = new Currency()
				{
					One = "румунський лей",
					Few = "румунські леї",
					Many = "румунських леїв",
					Other = "румунського лея",
				},
				["RSD"] = new Currency()
				{
					One = "сербський динар",
					Few = "сербські динари",
					Many = "сербських динарів",
					Other = "сербського динара",
				},
				["RUB"] = new Currency()
				{
					One = "російський рубль",
					Few = "російські рублі",
					Many = "російських рублів",
					Other = "російського рубля",
				},
				["RWF"] = new Currency()
				{
					One = "руандійський франк",
					Few = "руандійські франки",
					Many = "руандійських франків",
					Other = "руандійського франка",
				},
				["SAR"] = new Currency()
				{
					One = "саудівський ріал",
					Few = "саудівські ріали",
					Many = "саудівських ріалів",
					Other = "саудівського ріала",
				},
				["SBD"] = new Currency()
				{
					One = "долар Соломонових Островів",
					Few = "долари Соломонових Островів",
					Many = "доларів Соломонових Островів",
					Other = "долара Соломонових Островів",
				},
				["SCR"] = new Currency()
				{
					One = "сейшельська рупія",
					Few = "сейшельські рупії",
					Many = "сейшельських рупій",
					Other = "сейшельської рупії",
				},
				["SDG"] = new Currency()
				{
					One = "суданський фунт",
					Few = "суданські фунти",
					Many = "суданських фунтів",
					Other = "суданського фунта",
				},
				["SEK"] = new Currency()
				{
					One = "шведська крона",
					Few = "шведські крони",
					Many = "шведських крон",
					Other = "шведської крони",
				},
				["SGD"] = new Currency()
				{
					One = "сінгапурський долар",
					Few = "сінгапурські долари",
					Many = "сінгапурських доларів",
					Other = "сінгапурського долара",
				},
				["SHP"] = new Currency()
				{
					One = "фунт острова Святої Єлени",
					Few = "фунти острова Святої Єлени",
					Many = "фунтів острова Святої Єлени",
					Other = "фунта острова Святої Єлени",
				},
				["SLL"] = new Currency()
				{
					Few = "леоне Сьєрра-Леоне",
					Many = "леоне Сьєрра-Леоне",
					Other = "леоне Сьєрра-Леоне",
				},
				["SOS"] = new Currency()
				{
					One = "сомалійський шилінг",
					Few = "сомалійські шилінги",
					Many = "сомалійських шилінгів",
					Other = "сомалійського шилінга",
				},
				["SRD"] = new Currency()
				{
					One = "суринамський долар",
					Few = "суринамські долари",
					Many = "суринамських доларів",
					Other = "суринамського долара",
				},
				["SSP"] = new Currency()
				{
					One = "південносуданський фунт",
					Few = "південносуданські фунти",
					Many = "південносуданських фунтів",
					Other = "південносуданського фунта",
				},
				["STN"] = new Currency()
				{
					One = "добра Сан-Томе і Прінсіпі",
					Few = "добри Сан-Томе і Принсіпі",
					Many = "добр Сан-Томе і Принсіпі",
					Other = "добри Сан-Томе і Прінсіпі",
				},
				["SYP"] = new Currency()
				{
					One = "сирійський фунт",
					Few = "сирійські фунти",
					Many = "сирійських фунтів",
					Other = "сирійського фунта",
				},
				["SZL"] = new Currency()
				{
					One = "свазілендський лілангені",
					Few = "свазілендські лілангені",
					Many = "свазілендських лілангені",
					Other = "свазілендського лілангені",
				},
				["THB"] = new Currency()
				{
					One = "таїландський бат",
					Few = "таїландські бати",
					Many = "таїландських батів",
					Other = "таїландського бата",
				},
				["TJS"] = new Currency()
				{
					One = "таджицький сомоні",
					Few = "таджицькі сомоні",
					Many = "таджицьких сомоні",
					Other = "таджицького сомоні",
				},
				["TMT"] = new Currency()
				{
					One = "туркменський манат",
					Few = "туркменські манати",
					Many = "туркменських манатів",
					Other = "туркменського маната",
				},
				["TND"] = new Currency()
				{
					One = "туніський динар",
					Few = "туніські динари",
					Many = "туніських динарів",
					Other = "туніського динара",
				},
				["TOP"] = new Currency()
				{
					One = "тонганська паанга",
					Few = "тонганські паанги",
					Many = "тонганських паанг",
					Other = "тонганської паанги",
				},
				["TRY"] = new Currency()
				{
					One = "турецька ліра",
					Few = "турецькі ліри",
					Many = "турецьких лір",
					Other = "турецької ліри",
				},
				["TTD"] = new Currency()
				{
					One = "долар Тринідаду і Тобаго",
					Few = "долари Тринідаду і Тобаго",
					Many = "доларів Тринідаду і Тобаго",
					Other = "долара Тринідаду і Тобаго",
				},
				["TWD"] = new Currency()
				{
					One = "новий тайванський долар",
					Few = "нові тайванські долари",
					Many = "нових тайванських доларів",
					Other = "нового тайванського долара",
				},
				["TZS"] = new Currency()
				{
					One = "танзанійський шилінг",
					Few = "танзанійські шилінги",
					Many = "танзанійських шилінгів",
					Other = "танзанійського шилінга",
				},
				["UAH"] = new Currency()
				{
					One = "українська гривня",
					Few = "українські гривні",
					Many = "українських гривень",
					Other = "української гривні",
				},
				["UGX"] = new Currency()
				{
					One = "угандійський шилінг",
					Few = "угандійські шилінги",
					Many = "угандійських шилінгів",
					Other = "угандійського шилінга",
				},
				["USD"] = new Currency()
				{
					One = "долар США",
					Few = "долари США",
					Many = "доларів США",
					Other = "долара США",
				},
				["UYU"] = new Currency()
				{
					One = "уругвайський песо",
					Few = "уругвайські песо",
					Many = "уругвайських песо",
					Other = "уругвайського песо",
				},
				["UZS"] = new Currency()
				{
					One = "узбецький сум",
					Few = "узбецькі суми",
					Many = "узбецьких сумів",
					Other = "узбецького сума",
				},
				["VES"] = new Currency()
				{
					One = "венесуельський болівар",
					Few = "венесуельські болівари",
					Many = "венесуельських боліварів",
					Other = "венесуельського болівара",
				},
				["VND"] = new Currency()
				{
					One = "вʼєтнамський донг",
					Few = "вʼєтнамські донги",
					Many = "вʼєтнамських донгів",
					Other = "вʼєтнамського донга",
				},
				["VUV"] = new Currency()
				{
					One = "вануатський вату",
					Few = "вануатські вату",
					Many = "вануатських вату",
					Other = "вануатського вату",
				},
				["WST"] = new Currency()
				{
					One = "самоанська тала",
					Few = "самоанські тали",
					Many = "самоанських тал",
					Other = "самоанської тали",
				},
				["XAF"] = new Currency()
				{
					One = "центральноафриканський франк",
					Few = "центральноафриканські франки",
					Many = "центральноафриканських франків",
					Other = "центральноафриканського франка",
				},
				["XCD"] = new Currency()
				{
					One = "східнокарибський долар",
					Few = "східнокарибські долари",
					Many = "східнокарибських доларів",
					Other = "східнокарибського долара",
				},
				["XOF"] = new Currency()
				{
					One = "західноафриканський франк",
					Few = "західноафриканські франки",
					Many = "західноафриканських франків",
					Other = "західноафриканського франка",
				},
				["XPF"] = new Currency()
				{
					One = "французький тихоокеанський франк",
					Few = "французькі тихоокеанські франки",
					Many = "французьких тихоокеанських франків",
					Other = "французького тихоокеанського франка",
				},
				["YER"] = new Currency()
				{
					One = "єменський ріал",
					Few = "єменські ріали",
					Many = "єменських ріалів",
					Other = "єменського ріала",
				},
				["ZAR"] = new Currency()
				{
					One = "південноафриканський ранд",
					Few = "південноафриканські ранди",
					Many = "південноафриканських рандів",
					Other = "південноафриканського ранда",
				},
				["ZMW"] = new Currency()
				{
					One = "замбійська квача",
					Few = "замбійські квачі",
					Many = "замбійських квач",
					Other = "замбійської квачі",
				},
				["ZWL"] = new Currency()
				{
					One = "зімбабвійський долар (2009)",
					Few = "зімбабвійські долари (2009)",
					Many = "зімбабвійських доларів (2009)",
					Other = "зімбабвійського долара (2009)",
				},
			};
		}
	}
}
