using WrittenNumber.Models;

namespace WrittenNumber.Data.sr
{
	public static class Currencies
	{
		public static Dictionary<string, Currency> Get()
		{
			return new Dictionary<string, Currency>()
			{
				["AED"] = new Currency()
				{
					One = "дирхам УАЕ",
					Few = "дирхама УАЕ",
					Other = "дирхама УАЕ",
				},
				["AFN"] = new Currency()
				{
					One = "aвганистански авгани",
					Few = "авганистанска авгана",
					Other = "авганистанских авгана",
				},
				["ALL"] = new Currency()
				{
					One = "албански лек",
					Few = "албанска лека",
					Other = "албанских лека",
				},
				["AMD"] = new Currency()
				{
					One = "јерменски драм",
					Few = "јерменска драма",
					Other = "јерменска драма",
				},
				["ANG"] = new Currency()
				{
					One = "холандскоантилски гулден",
					Few = "холандскоантилска гулдена",
					Other = "холандскоантилских гулдена",
				},
				["AOA"] = new Currency()
				{
					One = "анголска кванза",
					Few = "анголске кванзе",
					Other = "анголских кванзи",
				},
				["ARS"] = new Currency()
				{
					One = "аргентински пезос",
					Few = "аргентинска пезоса",
					Other = "аргентинских пезоса",
				},
				["AUD"] = new Currency()
				{
					One = "аустралијски долар",
					Few = "аустралијска долара",
					Other = "аустралијских долара",
				},
				["AWG"] = new Currency()
				{
					One = "арубански флорин",
					Few = "арубанска флорина",
					Other = "арубанских флорина",
				},
				["BAM"] = new Currency()
				{
					One = "босанско-херцеговачка конвертибилна марка",
					Few = "босанско-херцеговачке конвертибилне маркe",
					Other = "босанско-херцеговачких конвертибилних марака",
				},
				["BBD"] = new Currency()
				{
					One = "барбадошки долар",
					Few = "барбадошка долара",
					Other = "барбадошких долара",
				},
				["BDT"] = new Currency()
				{
					One = "бангладешка така",
					Few = "бангладешке таке",
					Other = "бангладешких така",
				},
				["BGN"] = new Currency()
				{
					One = "бугарски лев",
					Few = "бугарска лева",
					Other = "бугарских лева",
				},
				["BHD"] = new Currency()
				{
					One = "бахреински динар",
					Few = "бахреинскa динара",
					Other = "бахреинских динара",
				},
				["BIF"] = new Currency()
				{
					One = "бурундски франак",
					Few = "бурундска франка",
					Other = "бурундских франакa",
				},
				["BMD"] = new Currency()
				{
					One = "бермудски долар",
					Few = "бермудска долара",
					Other = "бермудских долара",
				},
				["BND"] = new Currency()
				{
					One = "брунејски долар",
					Few = "брунејска долара",
					Other = "брунејских долара",
				},
				["BOB"] = new Currency()
				{
					One = "боливијски боливијано",
					Few = "боливијска боливијана",
					Other = "боливијских боливијана",
				},
				["BOV"] = new Currency()
				{
					One = "боливијски мвдол",
					Few = "боливијска мвдола",
					Other = "боливијских мвдола",
				},
				["BRL"] = new Currency()
				{
					One = "бразилски реал",
					Few = "бразилска реала",
					Other = "бразилских реала",
				},
				["BTN"] = new Currency()
				{
					One = "бутански нгултрум",
					Few = "бутанска нгултрума",
					Other = "бутанских нгултрума",
				},
				["BWP"] = new Currency()
				{
					One = "боцванска пула",
					Few = "боцванске пуле",
					Other = "боцванских пула",
				},
				["BYN"] = new Currency()
				{
					One = "белоруска рубља",
					Few = "белоруске рубље",
					Other = "белоруских рубљи",
				},
				["BZD"] = new Currency()
				{
					One = "белиски долар",
					Few = "белиска долара",
					Other = "белиских долара",
				},
				["CAD"] = new Currency()
				{
					One = "канадски долар",
					Few = "канадска долара",
					Other = "канадских долара",
				},
				["CDF"] = new Currency()
				{
					One = "конгоански франак",
					Few = "конгоанска франка",
					Other = "конгоанских франака",
				},
				["CHE"] = new Currency()
				{
					One = "WIR евро",
					Few = "WIR евра",
					Other = "WIR евра",
				},
				["CHF"] = new Currency()
				{
					One = "швајцарски франак",
					Few = "швајцарска франка",
					Other = "швајцарских франака",
				},
				["CHW"] = new Currency()
				{
					One = "WIR франак",
					Few = "WIR франка",
					Other = "WIR франака",
				},
				["CLF"] = new Currency()
				{
					One = "чилеански унидадес де фоменто",
					Few = "чилеанска унидадес де фомента",
					Other = "чилеански унидадеси де фоменто",
				},
				["CNY"] = new Currency()
				{
					One = "кинески јуан",
					Few = "кинеска јуана",
					Other = "кинеских јуана",
				},
				["COP"] = new Currency()
				{
					One = "колумбијски пезос",
					Few = "колумбијска пезоса",
					Other = "колумбијских пезоса",
				},
				["COU"] = new Currency()
				{
					One = "унидад де валоршки реал",
					Few = "нидад де валор реала",
					Other = "унидад де валоршких реала",
				},
				["CRC"] = new Currency()
				{
					One = "костарикански колон",
					Few = "костариканска колона",
					Other = "костариканских колона",
				},
				["CUC"] = new Currency()
				{
					One = "кубански конвертибилни пезос",
					Few = "кубанска конвертибилна пезоса",
					Other = "кубанских конвертибилних пезоса",
				},
				["CUP"] = new Currency()
				{
					One = "кубански пезос",
					Few = "кубанска пезоса",
					Other = "кубанских пезоса",
				},
				["CVE"] = new Currency()
				{
					One = "зеленортски ескудо",
					Few = "зеленортска ескуда",
					Other = "зеленортских ескуда",
				},
				["CZK"] = new Currency()
				{
					One = "чешка круна",
					Few = "чешке круне",
					Other = "чешких крунa",
				},
				["DJF"] = new Currency()
				{
					One = "џибутски франак",
					Few = "џибутска франка",
					Other = "џибутских франака",
				},
				["DKK"] = new Currency()
				{
					One = "данска круна",
					Few = "данске круне",
					Other = "данских круна",
				},
				["DOP"] = new Currency()
				{
					One = "доминикански пезос",
					Few = "доминиканска пезоса",
					Other = "доминиканских пезоса",
				},
				["DZD"] = new Currency()
				{
					One = "алжирски динар",
					Few = "алжирска динара",
					Other = "алжирских динара",
				},
				["EGP"] = new Currency()
				{
					One = "египатска фунта",
					Few = "египатске фунте",
					Other = "египатских фунти",
				},
				["ERN"] = new Currency()
				{
					One = "еритрејска накфа",
					Few = "еритрејске накфе",
					Other = "еритрејских накфи",
				},
				["ETB"] = new Currency()
				{
					One = "етиопски бир",
					Few = "етиопска бира",
					Other = "етиопских бира",
				},
				["EUR"] = new Currency()
				{
					One = "евро",
					Few = "евра",
					Other = "евра",
				},
				["FJD"] = new Currency()
				{
					One = "фиџијски долар",
					Few = "фиџијска долара",
					Other = "фиџијских долара",
				},
				["FKP"] = new Currency()
				{
					One = "фокландска фунта",
					Few = "фокландске фунте",
					Other = "фокландских фунти",
				},
				["GBP"] = new Currency()
				{
					One = "британска фунта",
					Few = "британске фунте",
					Other = "британских фунти",
				},
				["GEL"] = new Currency()
				{
					One = "грузијски лари",
					Few = "грузијска ларија",
					Other = "грузијских ларија",
				},
				["GHS"] = new Currency()
				{
					One = "гански седи",
					Few = "ганска седија",
					Other = "ганских седија",
				},
				["GIP"] = new Currency()
				{
					One = "гибралтарска фунта",
					Few = "гибралтарске фунте",
					Other = "гибралтарских фунти",
				},
				["GMD"] = new Currency()
				{
					One = "гамбијски даласи",
					Few = "гамбијских даласија",
					Other = "гамбијских даласија",
				},
				["GNF"] = new Currency()
				{
					One = "гвинејски франак",
					Few = "гвинејска франка",
					Other = "гвинејских франака",
				},
				["GTQ"] = new Currency()
				{
					One = "гватемалски кецал",
					Few = "гватемалска кецала",
					Other = "гватемалских кецала",
				},
				["GYD"] = new Currency()
				{
					One = "гвајански долар",
					Few = "гвајанска долара",
					Other = "гвајанских долара",
				},
				["HKD"] = new Currency()
				{
					One = "хонгконшки долар",
					Few = "хонгконшка долара",
					Other = "хонгконшких долара",
				},
				["HNL"] = new Currency()
				{
					One = "хондурашка лемпира",
					Few = "хондурашке лемпире",
					Other = "хондурашких лемпира",
				},
				["HRK"] = new Currency()
				{
					One = "хрватска куна",
					Few = "хрватске куне",
					Other = "хрватских куна",
				},
				["HTG"] = new Currency()
				{
					One = "хаићански гурд",
					Few = "хаићанска гурда",
					Other = "хаићанских гурда",
				},
				["HUF"] = new Currency()
				{
					One = "мађарска форинта",
					Few = "мађарске форинте",
					Other = "мађарских форинти",
				},
				["IDR"] = new Currency()
				{
					One = "индонежанска рупија",
					Few = "индонежанске рупије",
					Other = "индонежанских рупијa",
				},
				["ILS"] = new Currency()
				{
					One = "израелски нови шекел",
					Few = "израелска нова шекела",
					Other = "израелских нових шекела",
				},
				["INR"] = new Currency()
				{
					One = "индијска рупија",
					Few = "индијске рупије",
					Other = "индијских рупија",
				},
				["IQD"] = new Currency()
				{
					One = "ирачки динар",
					Few = "ирачка динара",
					Other = "ирачких динара",
				},
				["IRR"] = new Currency()
				{
					One = "ирански ријал",
					Few = "иранска ријала",
					Other = "иранских ријала",
				},
				["ISK"] = new Currency()
				{
					One = "исландска круна",
					Few = "исландске круне",
					Other = "исландских круна",
				},
				["JMD"] = new Currency()
				{
					One = "jамајчански долар",
					Few = "jамајчанска долара",
					Other = "jамајчанскиx долара",
				},
				["JOD"] = new Currency()
				{
					One = "јордански динар",
					Few = "јорданскa динара",
					Other = "јорданских динара",
				},
				["JPY"] = new Currency()
				{
					One = "јапански јен",
					Few = "јапанска јена",
					Other = "јапанских јена",
				},
				["KES"] = new Currency()
				{
					One = "кенијски шилинг",
					Few = "кенијска шилинга",
					Other = "кенијских шилинга",
				},
				["KGS"] = new Currency()
				{
					One = "киргистански сом",
					Few = "киргистанска сома",
					Other = "киргистанских сома",
				},
				["KHR"] = new Currency()
				{
					One = "камбоџански ријел",
					Few = "камбоџанска ријела",
					Other = "камбоџанских ријела",
				},
				["KMF"] = new Currency()
				{
					One = "коморски франак",
					Few = "коморскa франкa",
					Other = "коморских франакa",
				},
				["KPW"] = new Currency()
				{
					One = "севернокорејски вон",
					Few = "севернокорејска вона",
					Other = "севернокорејских вона",
				},
				["KRW"] = new Currency()
				{
					One = "јужнокорејски вон",
					Few = "јужнокорејска вона",
					Other = "јужнокорејских вона",
				},
				["KWD"] = new Currency()
				{
					One = "кувајтски динар",
					Few = "кувајтскa динара",
					Other = "кувајтских динара",
				},
				["KYD"] = new Currency()
				{
					One = "кајмански долар",
					Few = "кајманска долара",
					Other = "кајманских долара",
				},
				["KZT"] = new Currency()
				{
					One = "казахстански тенге",
					Few = "казахстанска тенгеа",
					Other = "казахстанских тенгеа",
				},
				["LAK"] = new Currency()
				{
					One = "лаоски кип",
					Few = "лаоска кипа",
					Other = "лаоских кипа",
				},
				["LBP"] = new Currency()
				{
					One = "либанскa фунтa",
					Few = "либанскe фунтe",
					Other = "либанских фунти",
				},
				["LKR"] = new Currency()
				{
					One = "шриланчанска рупија",
					Few = "шриланчанске рупије",
					Other = "шриланчанских рупија",
				},
				["LRD"] = new Currency()
				{
					One = "либеријски долар",
					Few = "либеријска долара",
					Other = "либеријских долара",
				},
				["LSL"] = new Currency()
				{
					One = "лесотски лоти",
					Few = "лесотска лотија",
					Other = "лесотских лотија",
				},
				["LYD"] = new Currency()
				{
					One = "либијски динар",
					Few = "либијскa динарa",
					Other = "либијских динарa",
				},
				["MAD"] = new Currency()
				{
					One = "марокански дирхам",
					Few = "мароканска дирхама",
					Other = "мароканских дирхама",
				},
				["MDL"] = new Currency()
				{
					One = "молдaвски леј",
					Few = "молдaвскa леја",
					Other = "молдaвских леја",
				},
				["MGA"] = new Currency()
				{
					One = "малгашки аријари",
					Few = "малгашка аријарија",
					Other = "малгашких аријарија",
				},
				["MKD"] = new Currency()
				{
					One = "македонски денар",
					Few = "македонска денара",
					Other = "македонских денара",
				},
				["MMK"] = new Currency()
				{
					One = "мјанмарски кјат",
					Few = "мјанмарскa кјатa",
					Other = "мјанмарских кјатa",
				},
				["MNT"] = new Currency()
				{
					One = "монголски тугрик",
					Few = "монголскa тугрика",
					Other = "монголских тугрика",
				},
				["MOP"] = new Currency()
				{
					One = "макаоска патака",
					Few = "макаоске патаке",
					Other = "макаоских патака",
				},
				["MRU"] = new Currency()
				{
					One = "мауританска огија",
					Few = "мауританске огије",
					Other = "мауританских огија",
				},
				["MUR"] = new Currency()
				{
					One = "маурицијска рупија",
					Few = "маурицијскe рупијe",
					Other = "маурицијских рупија",
				},
				["MVR"] = new Currency()
				{
					One = "малдивскa руфија",
					Few = "малдивскe руфијe",
					Other = "малдивских руфија",
				},
				["MWK"] = new Currency()
				{
					One = "малавијска квача",
					Few = "малавијске кваче",
					Other = "малавијских квача",
				},
				["MXN"] = new Currency()
				{
					One = "мексички пезос",
					Few = "мексичка пезоса",
					Other = "мексичких пезоса",
				},
				["MXV"] = new Currency()
				{
					One = "мексички унидадс де инверзион",
					Few = "мексичка унидадс де инверзиона",
					Other = "мексичких унидадс де инверзиона",
				},
				["MYR"] = new Currency()
				{
					One = "малезијски рингит",
					Few = "малезијска рингита",
					Other = "малезијских рингита",
				},
				["MZN"] = new Currency()
				{
					One = "мозамбички метикал",
					Few = "мозамбичка метикала",
					Other = "мозамбичких метикала",
				},
				["NAD"] = new Currency()
				{
					One = "намибијски долар",
					Few = "намибијска долара",
					Other = "намибијских долара",
				},
				["NGN"] = new Currency()
				{
					One = "нигеријска наира",
					Few = "нигеријске наире",
					Other = "нигеријских наира",
				},
				["NIO"] = new Currency()
				{
					One = "никарагванска кордоба",
					Few = "никарагванске кордобе",
					Other = "никарагванских кордоба",
				},
				["NOK"] = new Currency()
				{
					One = "норвешка круна",
					Few = "норвешке круне",
					Other = "норвешких круна",
				},
				["NPR"] = new Currency()
				{
					One = "непалска рупија",
					Few = "непалске рупије",
					Other = "непалских рупија",
				},
				["NZD"] = new Currency()
				{
					One = "новозеландски долар",
					Few = "новозеландска долара",
					Other = "новозеландских долара",
				},
				["OMR"] = new Currency()
				{
					One = "омански ријал",
					Few = "оманскa ријала",
					Other = "оманских ријала",
				},
				["PAB"] = new Currency()
				{
					One = "панамска балбоа",
					Few = "панамске балбое",
					Other = "панамских балбоа",
				},
				["PEN"] = new Currency()
				{
					One = "перуански сол",
					Few = "перуанска сола",
					Other = "перуанских сола",
				},
				["PGK"] = new Currency()
				{
					One = "папуанска кина",
					Few = "папуанскe кинe",
					Other = "папуанских кинa",
				},
				["PHP"] = new Currency()
				{
					One = "филипински пезос",
					Few = "филипинска пезоса",
					Other = "филипинских пезоса",
				},
				["PKR"] = new Currency()
				{
					One = "пакистанска рупија",
					Few = "пакистанске рупије",
					Other = "пакистанских рупија",
				},
				["PLN"] = new Currency()
				{
					One = "пољски злот",
					Few = "пољска злота",
					Other = "пољских злота",
				},
				["PYG"] = new Currency()
				{
					One = "парагвајски гварани",
					Few = "парагвајска гваранија",
					Other = "парагвајских гваранија",
				},
				["QAR"] = new Currency()
				{
					One = "катарски ријал",
					Few = "катарска ријала",
					Other = "катарских ријала",
				},
				["RON"] = new Currency()
				{
					One = "румунски леј",
					Few = "румунскa леја",
					Other = "румунских леја",
				},
				["RSD"] = new Currency()
				{
					One = "српски динар",
					Few = "српска динара",
					Other = "српских динара",
				},
				["RUB"] = new Currency()
				{
					One = "руска рубља",
					Few = "руске рубље",
					Other = "руских рубљи",
				},
				["RWF"] = new Currency()
				{
					One = "руандски франак",
					Few = "руандскa франка",
					Other = "руандских франака",
				},
				["SAR"] = new Currency()
				{
					One = "саудијски ријал",
					Few = "саудијска ријала",
					Other = "саудијских ријала",
				},
				["SBD"] = new Currency()
				{
					One = "соломонски долар",
					Few = "соломонска долара",
					Other = "соломонских долара",
				},
				["SCR"] = new Currency()
				{
					One = "сејшелска рупија",
					Few = "сејшелске рупије",
					Other = "сејшелских рупија",
				},
				["SDG"] = new Currency()
				{
					One = "суданска фунта",
					Few = "суданске фунте",
					Other = "суданских фунти",
				},
				["SEK"] = new Currency()
				{
					One = "шведска круна",
					Few = "шведске круне",
					Other = "шведских круна",
				},
				["SGD"] = new Currency()
				{
					One = "сингапурски долар",
					Few = "сингапурска долара",
					Other = "сингапурских долара",
				},
				["SHP"] = new Currency()
				{
					One = "фунта Свете Јелене",
					Few = "фунте Свете Јелене",
					Other = "фунти Свете Јелене",
				},
				["SLL"] = new Currency()
				{
					One = "сијералеонски леоне",
					Few = "сијералеонска леона",
					Other = "сијералеонских леона",
				},
				["SOS"] = new Currency()
				{
					One = "сомалијски шилинг",
					Few = "сомалијска шилинга",
					Other = "сомалијских шилинга",
				},
				["SRD"] = new Currency()
				{
					One = "суринамски долар",
					Few = "суринамска долара",
					Other = "суринамских долара",
				},
				["SSP"] = new Currency()
				{
					One = "јужносуданска фунта",
					Few = "јужносуданскe фунтe",
					Other = "јужносуданских фунти",
				},
				["STN"] = new Currency()
				{
					One = "саотомска добра",
					Few = "саотомске добре",
					Other = "саотомских добри",
				},
				["SVC"] = new Currency()
				{
					One = "салвадорски колон",
					Few = "салвадорска колона",
					Other = "салвадорских колона",
				},
				["SYP"] = new Currency()
				{
					One = "сиријска фунта",
					Few = "сиријске фунте",
					Other = "сиријских фунти",
				},
				["SZL"] = new Currency()
				{
					One = "свазилендски лилангени",
					Few = "свазилендска лилангенија",
					Other = "свазилендских лилангенија",
				},
				["THB"] = new Currency()
				{
					One = "тајландски бат",
					Few = "тајландска бата",
					Other = "тајландских бата",
				},
				["TJS"] = new Currency()
				{
					One = "таџикистански сомон",
					Few = "таџикистанска сомона",
					Other = "таџикистанских сомона",
				},
				["TMT"] = new Currency()
				{
					One = "туркменистански манат",
					Few = "туркменистанскa манатa",
					Other = "туркменистанских маната",
				},
				["TND"] = new Currency()
				{
					One = "туниски динар",
					Few = "туниска динара",
					Other = "туниских динара",
				},
				["TOP"] = new Currency()
				{
					One = "тонганска панга",
					Few = "тонганске панге",
					Other = "тонганских панги",
				},
				["TRY"] = new Currency()
				{
					One = "турска лира",
					Few = "турске лире",
					Other = "турских лира",
				},
				["TTD"] = new Currency()
				{
					One = "тринидад-тобагошки долар",
					Few = "тринидад-тобагошка долара",
					Other = "тринидад-тобагошких долара",
				},
				["TWD"] = new Currency()
				{
					One = "нови тајвански долар",
					Few = "нова тајванска долара",
					Other = "нових тајванских долара",
				},
				["TZS"] = new Currency()
				{
					One = "танзанијски шилинг",
					Few = "танзанијска шилинга",
					Other = "танзанијских шилинга",
				},
				["UAH"] = new Currency()
				{
					One = "украјинска гривна",
					Few = "украјинскe гривнe",
					Other = "украјинских хривњи",
				},
				["UGX"] = new Currency()
				{
					One = "угандски шилинг",
					Few = "угандскa шилинга",
					Other = "угандских шилинга",
				},
				["USD"] = new Currency()
				{
					One = "амерички долар",
					Few = "америчка долара",
					Other = "америчких долара",
				},
				["UYU"] = new Currency()
				{
					One = "уругвајски пезос",
					Few = "уругвајска пезоса",
					Other = "уругвајских пезоса",
				},
				["UZS"] = new Currency()
				{
					One = "узбекистански сом",
					Few = "узбекистанска сома",
					Other = "узбекистанских сома",
				},
				["VES"] = new Currency()
				{
					One = "венецуелански боливар",
					Few = "венецуеланска боливара",
					Other = "венецуеланских боливара",
				},
				["VND"] = new Currency()
				{
					One = "вијетнамски донг",
					Few = "вијетнамска донга",
					Other = "вијетнамских донга",
				},
				["VUV"] = new Currency()
				{
					One = "вануатски вату",
					Few = "вануатскa ватуa",
					Other = "вануатских ватуa",
				},
				["WST"] = new Currency()
				{
					One = "самоанска тала",
					Few = "самоанске тале",
					Other = "самоанских тала",
				},
				["XAF"] = new Currency()
				{
					One = "централноафрички франак",
					Few = "централноафричка франка",
					Other = "централноафричких франака",
				},
				["XCD"] = new Currency()
				{
					One = "источнокарипски долар",
					Few = "источнокарипскa доларa",
					Other = "источнокарипскиx доларa",
				},
				["XOF"] = new Currency()
				{
					One = "западноафрички франак",
					Few = "западноафричка франка",
					Other = "западноафричких франака",
				},
				["XPF"] = new Currency()
				{
					One = "CFP франак",
					Few = "CFP франка",
					Other = "CFP франака",
				},
				["YER"] = new Currency()
				{
					One = "јеменски ријал",
					Few = "јеменска ријала",
					Other = "jеменских ријала",
				},
				["ZAR"] = new Currency()
				{
					One = "јужноафрички ранд",
					Few = "јужноафричка ранда",
					Other = "јужноафричких ранда",
				},
				["ZMW"] = new Currency()
				{
					One = "замбијска квача",
					Few = "замбијске кваче",
					Other = "замбијских квача",
				},
				["ZWL"] = new Currency()
				{
					One = "зимбабвејски долар (2009)",
					Few = "зимбабвејска долара (2009)",
					Other = "зимбабвејских долара (2009)",
				},
			};
		}
	}
}
