using WrittenNumber.Models;

namespace WrittenNumber.Data.ar
{
	public static class Currencies
	{
		public static Dictionary<string, Currency> Get()
		{
			return new Dictionary<string, Currency>()
			{
				["AED"] = new Currency()
				{
					Two = "درهم إماراتي",
					Few = "درهم إماراتي",
					Many = "درهم إماراتي",
					Other = "درهم إماراتي",
				},
				["AFN"] = new Currency()
				{
					Two = "أفغاني أفغانستاني",
					Few = "أفغاني أفغانستاني",
					Many = "أفغاني أفغانستاني",
					Other = "أفغاني أفغانستاني",
				},
				["ALL"] = new Currency()
				{
					Two = "ليك ألباني",
					Few = "ليك ألباني",
					Many = "ليك ألباني",
					Other = "ليك ألباني",
				},
				["AMD"] = new Currency()
				{
					Two = "درام أرميني",
					Few = "درام أرميني",
					Many = "درام أرميني",
					Other = "درام أرميني",
				},
				["ANG"] = new Currency()
				{
					Two = "غيلدر أنتيلي هولندي",
					Few = "غيلدر أنتيلي هولندي",
					Many = "غيلدر أنتيلي هولندي",
					Other = "غيلدر أنتيلي هولندي",
				},
				["AOA"] = new Currency()
				{
					Two = "كوانزا أنغولي",
					Few = "كوانزا أنغولي",
					Many = "كوانزا أنغولي",
					Other = "كوانزا أنغولي",
				},
				["ARS"] = new Currency()
				{
					Two = "بيزو أرجنتيني",
					Few = "بيزو أرجنتيني",
					Many = "بيزو أرجنتيني",
					Other = "بيزو أرجنتيني",
				},
				["AUD"] = new Currency()
				{
					Two = "دولار أسترالي",
					Few = "دولار أسترالي",
					Many = "دولار أسترالي",
					Other = "دولار أسترالي",
				},
				["AWG"] = new Currency()
				{
					Two = "فلورن أروبي",
					Few = "فلورن أروبي",
					Many = "فلورن أروبي",
					Other = "فلورن أروبي",
				},
				["BAM"] = new Currency()
				{
					Two = "مارك البوسنة والهرسك قابل للتحويل",
					Few = "مارك البوسنة والهرسك قابل للتحويل",
					Many = "مارك البوسنة والهرسك قابل للتحويل",
					Other = "مارك البوسنة والهرسك قابل للتحويل",
				},
				["BBD"] = new Currency()
				{
					Two = "دولار بربادوسي",
					Few = "دولار بربادوسي",
					Many = "دولار بربادوسي",
					Other = "دولار بربادوسي",
				},
				["BDT"] = new Currency()
				{
					Two = "تاكا بنغلاديشي",
					Few = "تاكا بنغلاديشي",
					Many = "تاكا بنغلاديشي",
					Other = "تاكا بنغلاديشي",
				},
				["BGN"] = new Currency()
				{
					Two = "ليف بلغاري",
					Few = "ليف بلغاري",
					Many = "ليف بلغاري",
					Other = "ليف بلغاري",
				},
				["BHD"] = new Currency()
				{
					Two = "دينار بحريني",
					Few = "دينار بحريني",
					Many = "دينار بحريني",
					Other = "دينار بحريني",
				},
				["BIF"] = new Currency()
				{
					Two = "فرنك بروندي",
					Few = "فرنك بروندي",
					Many = "فرنك بروندي",
					Other = "فرنك بروندي",
				},
				["BMD"] = new Currency()
				{
					Two = "دولار برمودي",
					Few = "دولار برمودي",
					Many = "دولار برمودي",
					Other = "دولار برمودي",
				},
				["BND"] = new Currency()
				{
					Two = "دولار بروناي",
					Few = "دولار بروناي",
					Many = "دولار بروناي",
					Other = "دولار بروناي",
				},
				["BOB"] = new Currency()
				{
					Two = "بوليفيانو بوليفي",
					Few = "بوليفيانو بوليفي",
					Many = "بوليفيانو بوليفي",
					Other = "بوليفيانو بوليفي",
				},
				["BRL"] = new Currency()
				{
					Two = "ريال برازيلي",
					Few = "ريال برازيلي",
					Many = "ريال برازيلي",
					Other = "ريال برازيلي",
				},
				["BTN"] = new Currency()
				{
					Two = "نولتوم بوتاني",
					Few = "نولتوم بوتاني",
					Many = "نولتوم بوتاني",
					Other = "نولتوم بوتاني",
				},
				["BWP"] = new Currency()
				{
					Two = "بولا بتسواني",
					Few = "بولا بتسواني",
					Many = "بولا بتسواني",
					Other = "بولا بتسواني",
				},
				["BYN"] = new Currency()
				{
					Two = "روبل بيلاروسي",
					Few = "روبل بيلاروسي",
					Many = "روبل بيلاروسي",
					Other = "روبل بيلاروسي",
				},
				["BZD"] = new Currency()
				{
					Two = "دولاران بليزيان",
					Few = "دولار بليزي",
					Many = "دولار بليزي",
					Other = "دولار بليزي",
				},
				["CAD"] = new Currency()
				{
					Two = "دولار كندي",
					Few = "دولار كندي",
					Many = "دولار كندي",
					Other = "دولار كندي",
				},
				["CDF"] = new Currency()
				{
					Two = "فرنك كونغولي",
					Few = "فرنك كونغولي",
					Many = "فرنك كونغولي",
					Other = "فرنك كونغولي",
				},
				["CHF"] = new Currency()
				{
					Two = "فرنك سويسري",
					Few = "فرنك سويسري",
					Many = "فرنك سويسري",
					Other = "فرنك سويسري",
				},
				["CNY"] = new Currency()
				{
					Two = "يوان صيني",
					Few = "يوان صيني",
					Many = "يوان صيني",
					Other = "يوان صيني",
				},
				["COP"] = new Currency()
				{
					Two = "بيزو كولومبي",
					Few = "بيزو كولومبي",
					Many = "بيزو كولومبي",
					Other = "بيزو كولومبي",
				},
				["CRC"] = new Currency()
				{
					Two = "كولن كوستاريكي",
					Few = "كولن كوستاريكي",
					Many = "كولن كوستاريكي",
					Other = "كولن كوستاريكي",
				},
				["CUC"] = new Currency()
				{
					Two = "بيزو كوبي قابل للتحويل",
					Few = "بيزو كوبي قابل للتحويل",
					Many = "بيزو كوبي قابل للتحويل",
					Other = "بيزو كوبي قابل للتحويل",
				},
				["CUP"] = new Currency()
				{
					Two = "بيزو كوبي",
					Few = "بيزو كوبي",
					Many = "بيزو كوبي",
					Other = "بيزو كوبي",
				},
				["CVE"] = new Currency()
				{
					Two = "اسكودو الرأس الأخضر",
					Few = "اسكودو الرأس الأخضر",
					Many = "اسكودو الرأس الأخضر",
					Other = "اسكودو الرأس الأخضر",
				},
				["CZK"] = new Currency()
				{
					Two = "كرونة تشيكية",
					Few = "كرونة تشيكية",
					Many = "كرونة تشيكية",
					Other = "كرونة تشيكية",
				},
				["DJF"] = new Currency()
				{
					Two = "فرنك جيبوتي",
					Few = "فرنك جيبوتي",
					Many = "فرنك جيبوتي",
					Other = "فرنك جيبوتي",
				},
				["DKK"] = new Currency()
				{
					Two = "كرونة دنماركية",
					Few = "كرونة دنماركية",
					Many = "كرونة دنماركية",
					Other = "كرونة دنماركية",
				},
				["DOP"] = new Currency()
				{
					Two = "بيزو الدومنيكان",
					Few = "بيزو الدومنيكان",
					Many = "بيزو الدومنيكان",
					Other = "بيزو الدومنيكان",
				},
				["DZD"] = new Currency()
				{
					Two = "ديناران جزائريان",
					Few = "دينارات جزائرية",
					Many = "دينارًا جزائريًا",
					Other = "دينار جزائري",
				},
				["EGP"] = new Currency()
				{
					Two = "جنيهان مصريان",
					Few = "جنيهات مصرية",
					Many = "جنيهًا مصريًا",
					Other = "جنيه مصري",
				},
				["ERN"] = new Currency()
				{
					Two = "ناكفا أريتري",
					Few = "ناكفا أريتري",
					Many = "ناكفا أريتري",
					Other = "ناكفا أريتري",
				},
				["ETB"] = new Currency()
				{
					Two = "بير أثيوبي",
					Few = "بير أثيوبي",
					Many = "بير أثيوبي",
					Other = "بير أثيوبي",
				},
				["EUR"] = new Currency()
				{
					Two = "يورو",
					Few = "يورو",
					Many = "يورو",
					Other = "يورو",
				},
				["FJD"] = new Currency()
				{
					Two = "دولار فيجي",
					Few = "دولار فيجي",
					Many = "دولار فيجي",
					Other = "دولار فيجي",
				},
				["FKP"] = new Currency()
				{
					Two = "جنيه جزر فوكلاند",
					Few = "جنيه جزر فوكلاند",
					Many = "جنيه جزر فوكلاند",
					Other = "جنيه جزر فوكلاند",
				},
				["GBP"] = new Currency()
				{
					Two = "جنيه إسترليني",
					Few = "جنيه إسترليني",
					Many = "جنيه إسترليني",
					Other = "جنيه إسترليني",
				},
				["GEL"] = new Currency()
				{
					Two = "لاري جورجي",
					Few = "لاري جورجي",
					Many = "لاري جورجي",
					Other = "لاري جورجي",
				},
				["GHS"] = new Currency()
				{
					Two = "سيدي غانا",
					Few = "سيدي غانا",
					Many = "سيدي غانا",
					Other = "سيدي غانا",
				},
				["GIP"] = new Currency()
				{
					Two = "جنيه جبل طارق",
					Few = "جنيه جبل طارق",
					Many = "جنيه جبل طارق",
					Other = "جنيه جبل طارق",
				},
				["GMD"] = new Currency()
				{
					Two = "دلاسي غامبي",
					Few = "دلاسي غامبي",
					Many = "دلاسي غامبي",
					Other = "دلاسي غامبي",
				},
				["GNF"] = new Currency()
				{
					Two = "فرنك غينيا",
					Few = "فرنك غينيا",
					Many = "فرنك غينيا",
					Other = "فرنك غينيا",
				},
				["GTQ"] = new Currency()
				{
					Two = "كوتزال غواتيمالا",
					Few = "كوتزال غواتيمالا",
					Many = "كوتزال غواتيمالا",
					Other = "كوتزال غواتيمالا",
				},
				["GYD"] = new Currency()
				{
					Two = "دولار غيانا",
					Few = "دولار غيانا",
					Many = "دولار غيانا",
					Other = "دولار غيانا",
				},
				["HKD"] = new Currency()
				{
					Two = "دولار هونغ كونغ",
					Few = "دولار هونغ كونغ",
					Many = "دولار هونغ كونغ",
					Other = "دولار هونغ كونغ",
				},
				["HNL"] = new Currency()
				{
					Two = "ليمبيرا هندوراس",
					Few = "ليمبيرا هندوراس",
					Many = "ليمبيرا هندوراس",
					Other = "ليمبيرا هندوراس",
				},
				["HRK"] = new Currency()
				{
					Two = "كونا كرواتي",
					Few = "كونا كرواتي",
					Many = "كونا كرواتي",
					Other = "كونا كرواتي",
				},
				["HTG"] = new Currency()
				{
					Two = "جوردى هايتي",
					Few = "جوردى هايتي",
					Many = "جوردى هايتي",
					Other = "جوردى هايتي",
				},
				["HUF"] = new Currency()
				{
					Two = "فورينت هنغاري",
					Few = "فورينت هنغاري",
					Many = "فورينت هنغاري",
					Other = "فورينت هنغاري",
				},
				["IDR"] = new Currency()
				{
					Two = "روبية إندونيسية",
					Few = "روبية إندونيسية",
					Many = "روبية إندونيسية",
					Other = "روبية إندونيسية",
				},
				["ILS"] = new Currency()
				{
					Two = "شيكل إسرائيلي جديد",
					Few = "شيكل إسرائيلي جديد",
					Many = "شيكل إسرائيلي جديد",
					Other = "شيكل إسرائيلي جديد",
				},
				["INR"] = new Currency()
				{
					Two = "روبية هندي",
					Few = "روبية هندي",
					Many = "روبية هندي",
					Other = "روبية هندي",
				},
				["IQD"] = new Currency()
				{
					Two = "دينار عراقي",
					Few = "دينار عراقي",
					Many = "دينار عراقي",
					Other = "دينار عراقي",
				},
				["IRR"] = new Currency()
				{
					Two = "ريال إيراني",
					Few = "ريال إيراني",
					Many = "ريال إيراني",
					Other = "ريال إيراني",
				},
				["ISK"] = new Currency()
				{
					Two = "كرونة أيسلندية",
					Few = "كرونة أيسلندية",
					Many = "كرونة أيسلندية",
					Other = "كرونة أيسلندية",
				},
				["JMD"] = new Currency()
				{
					Two = "دولار جامايكي",
					Few = "دولار جامايكي",
					Many = "دولار جامايكي",
					Other = "دولار جامايكي",
				},
				["JOD"] = new Currency()
				{
					Two = "دينار أردني",
					Few = "دينار أردني",
					Many = "دينار أردني",
					Other = "دينار أردني",
				},
				["JPY"] = new Currency()
				{
					Two = "ين ياباني",
					Few = "ين ياباني",
					Many = "ين ياباني",
					Other = "ين ياباني",
				},
				["KES"] = new Currency()
				{
					Two = "شلن كينيي",
					Few = "شلن كينيي",
					Many = "شلن كينيي",
					Other = "شلن كينيي",
				},
				["KGS"] = new Currency()
				{
					Two = "سوم قيرغستاني",
					Few = "سوم قيرغستاني",
					Many = "سوم قيرغستاني",
					Other = "سوم قيرغستاني",
				},
				["KHR"] = new Currency()
				{
					Two = "رييال كمبودي",
					Few = "رييال كمبودي",
					Many = "رييال كمبودي",
					Other = "رييال كمبودي",
				},
				["KMF"] = new Currency()
				{
					Two = "فرنك جزر القمر",
					Few = "فرنك جزر القمر",
					Many = "فرنك جزر القمر",
					Other = "فرنك جزر القمر",
				},
				["KPW"] = new Currency()
				{
					Two = "وون كوريا الشمالية",
					Few = "وون كوريا الشمالية",
					Many = "وون كوريا الشمالية",
					Other = "وون كوريا الشمالية",
				},
				["KRW"] = new Currency()
				{
					Two = "وون كوريا الجنوبية",
					Few = "وون كوريا الجنوبية",
					Many = "وون كوريا الجنوبية",
					Other = "وون كوريا الجنوبية",
				},
				["KWD"] = new Currency()
				{
					Two = "دينار كويتي",
					Few = "دينار كويتي",
					Many = "دينار كويتي",
					Other = "دينار كويتي",
				},
				["KYD"] = new Currency()
				{
					Two = "دولار جزر كيمن",
					Few = "دولار جزر كيمن",
					Many = "دولار جزر كيمن",
					Other = "دولار جزر كيمن",
				},
				["KZT"] = new Currency()
				{
					Two = "تينغ كازاخستاني",
					Few = "تينغ كازاخستاني",
					Many = "تينغ كازاخستاني",
					Other = "تينغ كازاخستاني",
				},
				["LAK"] = new Currency()
				{
					Two = "كيب لاوسي",
					Few = "كيب لاوسي",
					Many = "كيب لاوسي",
					Other = "كيب لاوسي",
				},
				["LBP"] = new Currency()
				{
					Two = "جنيه لبناني",
					Few = "جنيه لبناني",
					Many = "جنيه لبناني",
					Other = "جنيه لبناني",
				},
				["LKR"] = new Currency()
				{
					Two = "روبية سريلانكية",
					Few = "روبية سريلانكية",
					Many = "روبية سريلانكية",
					Other = "روبية سريلانكية",
				},
				["LRD"] = new Currency()
				{
					Two = "دولاران ليبيريان",
					Few = "دولارات ليبيرية",
					Many = "دولارًا ليبيريًا",
					Other = "دولار ليبيري",
				},
				["LSL"] = new Currency()
				{
					Two = "لوتي ليسوتو",
					Few = "لوتي ليسوتو",
					Many = "لوتي ليسوتو",
					Other = "لوتي ليسوتو",
				},
				["LYD"] = new Currency()
				{
					Two = "ديناران ليبيان",
					Few = "دينارات ليبية",
					Many = "دينارًا ليبيًا",
					Other = "دينار ليبي",
				},
				["MAD"] = new Currency()
				{
					Two = "درهمان مغربيان",
					Few = "دراهم مغربية",
					Many = "درهمًا مغربيًا",
					Other = "درهم مغربي",
				},
				["MDL"] = new Currency()
				{
					Two = "ليو مولدوفي",
					Few = "ليو مولدوفي",
					Many = "ليو مولدوفي",
					Other = "ليو مولدوفي",
				},
				["MGA"] = new Currency()
				{
					Two = "أرياري مدغشقر",
					Few = "أرياري مدغشقر",
					Many = "أرياري مدغشقر",
					Other = "أرياري مدغشقر",
				},
				["MKD"] = new Currency()
				{
					Two = "ديناران مقدونيان",
					Few = "دينارات مقدونية",
					Many = "دينارًا مقدونيًا",
					Other = "دينار مقدوني",
				},
				["MMK"] = new Currency()
				{
					Two = "كيات ميانمار",
					Few = "كيات ميانمار",
					Many = "كيات ميانمار",
					Other = "كيات ميانمار",
				},
				["MNT"] = new Currency()
				{
					Two = "توغروغ منغولي",
					Few = "توغروغ منغولي",
					Many = "توغروغ منغولي",
					Other = "توغروغ منغولي",
				},
				["MOP"] = new Currency()
				{
					Two = "باتاكا ماكاوي",
					Few = "باتاكا ماكاوي",
					Many = "باتاكا ماكاوي",
					Other = "باتاكا ماكاوي",
				},
				["MRU"] = new Currency()
				{
					Two = "أوقية موريتانية",
					Few = "أوقية موريتانية",
					Many = "أوقية موريتانية",
					Other = "أوقية موريتانية",
				},
				["MUR"] = new Currency()
				{
					Two = "روبية موريشيوسية",
					Few = "روبية موريشيوسية",
					Many = "روبية موريشيوسية",
					Other = "روبية موريشيوسية",
				},
				["MVR"] = new Currency()
				{
					Two = "روفيه جزر المالديف",
					Few = "روفيه جزر المالديف",
					Many = "روفيه جزر المالديف",
					Other = "روفيه جزر المالديف",
				},
				["MWK"] = new Currency()
				{
					Two = "كواشا مالاوي",
					Few = "كواشا مالاوي",
					Many = "كواشا مالاوي",
					Other = "كواشا مالاوي",
				},
				["MXN"] = new Currency()
				{
					Two = "بيزو مكسيكي",
					Few = "بيزو مكسيكي",
					Many = "بيزو مكسيكي",
					Other = "بيزو مكسيكي",
				},
				["MYR"] = new Currency()
				{
					Two = "رينغيت ماليزي",
					Few = "رينغيت ماليزي",
					Many = "رينغيت ماليزي",
					Other = "رينغيت ماليزي",
				},
				["MZN"] = new Currency()
				{
					Two = "متكال موزمبيقي",
					Few = "متكال موزمبيقي",
					Many = "متكال موزمبيقي",
					Other = "متكال موزمبيقي",
				},
				["NAD"] = new Currency()
				{
					Two = "دولار ناميبي",
					Few = "دولار ناميبي",
					Many = "دولار ناميبي",
					Other = "دولار ناميبي",
				},
				["NGN"] = new Currency()
				{
					Two = "نايرا نيجيري",
					Few = "نايرا نيجيري",
					Many = "نايرا نيجيري",
					Other = "نايرا نيجيري",
				},
				["NIO"] = new Currency()
				{
					Two = "قرطبة نيكاراغوا",
					Few = "قرطبة نيكاراغوا",
					Many = "قرطبة نيكاراغوا",
					Other = "قرطبة نيكاراغوا",
				},
				["NOK"] = new Currency()
				{
					Two = "كرونة نرويجية",
					Few = "كرونة نرويجية",
					Many = "كرونة نرويجية",
					Other = "كرونة نرويجية",
				},
				["NPR"] = new Currency()
				{
					Two = "روبية نيبالي",
					Few = "روبية نيبالي",
					Many = "روبية نيبالي",
					Other = "روبية نيبالي",
				},
				["NZD"] = new Currency()
				{
					Two = "دولار نيوزيلندي",
					Few = "دولار نيوزيلندي",
					Many = "دولار نيوزيلندي",
					Other = "دولار نيوزيلندي",
				},
				["OMR"] = new Currency()
				{
					Two = "ريال عماني",
					Few = "ريال عماني",
					Many = "ريال عماني",
					Other = "ريال عماني",
				},
				["PAB"] = new Currency()
				{
					Two = "بالبوا بنمي",
					Few = "بالبوا بنمي",
					Many = "بالبوا بنمي",
					Other = "بالبوا بنمي",
				},
				["PEN"] = new Currency()
				{
					Two = "سول بيروفي",
					Few = "سول بيروفي",
					Many = "سول بيروفي",
					Other = "سول بيروفي",
				},
				["PGK"] = new Currency()
				{
					Two = "كينا بابوا غينيا الجديدة",
					Few = "كينا بابوا غينيا الجديدة",
					Many = "كينا بابوا غينيا الجديدة",
					Other = "كينا بابوا غينيا الجديدة",
				},
				["PHP"] = new Currency()
				{
					Two = "بيزو فلبيني",
					Few = "بيزو فلبيني",
					Many = "بيزو فلبيني",
					Other = "بيزو فلبيني",
				},
				["PKR"] = new Currency()
				{
					Two = "روبية باكستاني",
					Few = "روبية باكستاني",
					Many = "روبية باكستاني",
					Other = "روبية باكستاني",
				},
				["PLN"] = new Currency()
				{
					Two = "زلوتي بولندي",
					Few = "زلوتي بولندي",
					Many = "زلوتي بولندي",
					Other = "زلوتي بولندي",
				},
				["PYG"] = new Currency()
				{
					Two = "غواراني باراغواي",
					Few = "غواراني باراغواي",
					Many = "غواراني باراغواي",
					Other = "غواراني باراغواي",
				},
				["QAR"] = new Currency()
				{
					Two = "ريال قطري",
					Few = "ريال قطري",
					Many = "ريال قطري",
					Other = "ريال قطري",
				},
				["RON"] = new Currency()
				{
					Two = "ليو روماني",
					Few = "ليو روماني",
					Many = "ليو روماني",
					Other = "ليو روماني",
				},
				["RSD"] = new Currency()
				{
					Two = "ديناران صربيان",
					Few = "دينارات صربية",
					Many = "دينارًا صربيًا",
					Other = "دينار صربي",
				},
				["RUB"] = new Currency()
				{
					Two = "روبل روسي",
					Few = "روبل روسي",
					Many = "روبل روسي",
					Other = "روبل روسي",
				},
				["RWF"] = new Currency()
				{
					Two = "فرنك رواندي",
					Few = "فرنك رواندي",
					Many = "فرنك رواندي",
					Other = "فرنك رواندي",
				},
				["SAR"] = new Currency()
				{
					Two = "ريال سعودي",
					Few = "ريال سعودي",
					Many = "ريال سعودي",
					Other = "ريال سعودي",
				},
				["SBD"] = new Currency()
				{
					Two = "دولار جزر سليمان",
					Few = "دولار جزر سليمان",
					Many = "دولار جزر سليمان",
					Other = "دولار جزر سليمان",
				},
				["SCR"] = new Currency()
				{
					Two = "روبية سيشيلية",
					Few = "روبية سيشيلية",
					Many = "روبية سيشيلية",
					Other = "روبية سيشيلية",
				},
				["SDG"] = new Currency()
				{
					Two = "جنيه سوداني",
					Few = "جنيهات سودانية",
					Many = "جنيهًا سودانيًا",
					Other = "جنيه سوداني",
				},
				["SEK"] = new Currency()
				{
					Two = "كرونة سويدية",
					Few = "كرونة سويدية",
					Many = "كرونة سويدية",
					Other = "كرونة سويدية",
				},
				["SGD"] = new Currency()
				{
					Two = "دولار سنغافوري",
					Few = "دولار سنغافوري",
					Many = "دولار سنغافوري",
					Other = "دولار سنغافوري",
				},
				["SHP"] = new Currency()
				{
					Two = "جنيه سانت هيلين",
					Few = "جنيه سانت هيلين",
					Many = "جنيه سانت هيلين",
					Other = "جنيه سانت هيلين",
				},
				["SLL"] = new Currency()
				{
					Two = "ليون سيراليوني",
					Few = "ليون سيراليوني",
					Many = "ليون سيراليوني",
					Other = "ليون سيراليوني",
				},
				["SOS"] = new Currency()
				{
					Two = "شلن صومالي",
					Few = "شلن صومالي",
					Many = "شلن صومالي",
					Other = "شلن صومالي",
				},
				["SRD"] = new Currency()
				{
					Two = "دولار سورينامي",
					Few = "دولار سورينامي",
					Many = "دولار سورينامي",
					Other = "دولار سورينامي",
				},
				["SSP"] = new Currency()
				{
					Two = "جنيهان جنوب السودان",
					Few = "جنيهات جنوب السودان",
					Many = "جنيهًا جنوب السودان",
					Other = "جنيه جنوب السودان",
				},
				["STN"] = new Currency()
				{
					Two = "دوبرا ساو تومي وبرينسيبي",
					Few = "دوبرا ساو تومي وبرينسيبي",
					Many = "دوبرا ساو تومي وبرينسيبي",
					Other = "دوبرا ساو تومي وبرينسيبي",
				},
				["SYP"] = new Currency()
				{
					Two = "ليرة سورية",
					Few = "ليرة سورية",
					Many = "ليرة سورية",
					Other = "ليرة سورية",
				},
				["SZL"] = new Currency()
				{
					Two = "ليلانجيني سوازيلندي",
					Few = "ليلانجيني سوازيلندي",
					Many = "ليلانجيني سوازيلندي",
					Other = "ليلانجيني سوازيلندي",
				},
				["THB"] = new Currency()
				{
					Two = "باخت تايلاندي",
					Few = "باخت تايلاندي",
					Many = "باخت تايلاندي",
					Other = "باخت تايلاندي",
				},
				["TJS"] = new Currency()
				{
					Two = "سوموني طاجيكستاني",
					Few = "سوموني طاجيكستاني",
					Many = "سوموني طاجيكستاني",
					Other = "سوموني طاجيكستاني",
				},
				["TMT"] = new Currency()
				{
					Two = "مانات تركمانستان",
					Few = "مانات تركمانستان",
					Many = "مانات تركمانستان",
					Other = "مانات تركمانستان",
				},
				["TND"] = new Currency()
				{
					Two = "ديناران تونسيان",
					Few = "دينارات تونسية",
					Many = "دينارًا تونسيًا",
					Other = "دينار تونسي",
				},
				["TOP"] = new Currency()
				{
					Two = "بانغا تونغا",
					Few = "بانغا تونغا",
					Many = "بانغا تونغا",
					Other = "بانغا تونغا",
				},
				["TRY"] = new Currency()
				{
					Two = "ليرة تركية",
					Few = "ليرة تركية",
					Many = "ليرة تركية",
					Other = "ليرة تركية",
				},
				["TTD"] = new Currency()
				{
					Two = "دولار ترينداد وتوباغو",
					Few = "دولار ترينداد وتوباغو",
					Many = "دولار ترينداد وتوباغو",
					Other = "دولار ترينداد وتوباغو",
				},
				["TWD"] = new Currency()
				{
					Two = "دولار تايواني",
					Few = "دولار تايواني",
					Many = "دولار تايواني",
					Other = "دولار تايواني",
				},
				["TZS"] = new Currency()
				{
					Two = "شلن تنزاني",
					Few = "شلن تنزاني",
					Many = "شلن تنزاني",
					Other = "شلن تنزاني",
				},
				["UAH"] = new Currency()
				{
					Two = "هريفنيا أوكراني",
					Few = "هريفنيا أوكراني",
					Many = "هريفنيا أوكراني",
					Other = "هريفنيا أوكراني",
				},
				["UGX"] = new Currency()
				{
					Two = "شلن أوغندي",
					Few = "شلن أوغندي",
					Many = "شلن أوغندي",
					Other = "شلن أوغندي",
				},
				["USD"] = new Currency()
				{
					Two = "دولار أمريكي",
					Few = "دولار أمريكي",
					Many = "دولار أمريكي",
					Other = "دولار أمريكي",
				},
				["UYU"] = new Currency()
				{
					Two = "بيزو اوروغواي",
					Few = "بيزو اوروغواي",
					Many = "بيزو اوروغواي",
					Other = "بيزو اوروغواي",
				},
				["UZS"] = new Currency()
				{
					Two = "سوم أوزبكستاني",
					Few = "سوم أوزبكستاني",
					Many = "سوم أوزبكستاني",
					Other = "سوم أوزبكستاني",
				},
				["VES"] = new Currency()
				{
					Two = "بوليفار فنزويلي",
					Few = "بوليفار فنزويلي",
					Many = "بوليفار فنزويلي",
					Other = "بوليفار فنزويلي",
				},
				["VND"] = new Currency()
				{
					Two = "دونج فيتنامي",
					Few = "دونج فيتنامي",
					Many = "دونج فيتنامي",
					Other = "دونج فيتنامي",
				},
				["VUV"] = new Currency()
				{
					Two = "فاتو فانواتو",
					Few = "فاتو فانواتو",
					Many = "فاتو فانواتو",
					Other = "فاتو فانواتو",
				},
				["WST"] = new Currency()
				{
					Two = "تالا ساموا",
					Few = "تالا ساموا",
					Many = "تالا ساموا",
					Other = "تالا ساموا",
				},
				["XAF"] = new Currency()
				{
					Two = "فرنك وسط أفريقي",
					Few = "فرنك وسط أفريقي",
					Many = "فرنك وسط أفريقي",
					Other = "فرنك وسط أفريقي",
				},
				["XCD"] = new Currency()
				{
					Two = "دولار شرق الكاريبي",
					Few = "دولار شرق الكاريبي",
					Many = "دولار شرق الكاريبي",
					Other = "دولار شرق الكاريبي",
				},
				["XOF"] = new Currency()
				{
					Two = "فرنك غرب أفريقي",
					Few = "فرنك غرب أفريقي",
					Many = "فرنك غرب أفريقي",
					Other = "فرنك غرب أفريقي",
				},
				["XPF"] = new Currency()
				{
					Two = "فرنك سي إف بي",
					Few = "فرنك سي إف بي",
					Many = "فرنك سي إف بي",
					Other = "فرنك سي إف بي",
				},
				["YER"] = new Currency()
				{
					Two = "ريال يمني",
					Few = "ريال يمني",
					Many = "ريال يمني",
					Other = "ريال يمني",
				},
				["ZAR"] = new Currency()
				{
					Two = "راند جنوب أفريقيا",
					Few = "راند جنوب أفريقيا",
					Many = "راند جنوب أفريقيا",
					Other = "راند جنوب أفريقيا",
				},
				["ZMW"] = new Currency()
				{
					Two = "كواشا زامبي",
					Few = "كواشا زامبي",
					Many = "كواشا زامبي",
					Other = "كواشا زامبي",
				},
			};
		}
	}
}
